export interface NumerologyData {
  indexString: string;
  narrate: string;
  content: string;
}

type NumerologyDatabaseType = NumerologyData[];

export const NumerologyDatabase: NumerologyDatabaseType = [
  {
    indexString: '6,8,8,6,7,9,9,5',
    narrate: '谓午火真神得用理应名利双收，但五行缺木，五行无木，金过多，壬午癸巳又伤官见官火被消耗没能量，不能克金，而且虽有巳火助午，但是巳酉拱金，巳被消耗不能助午。申中又得长生使壬水更强克制午火。所以申酉两运破耗异常。丙戌运中助起用神大得际遇，一交亥运，壬水得禄，癸水临旺，火气克尽，家婆身亡',
    content: '永远不知道自己想干什么，+40大得际遇，+50家破身亡。'
  },
  {
    indexString: '6,8,8,6,7,9,0,6',
    narrate: '金过旺，用午中丁火来杀之，壬午中壬水消耗午火，妙在甲午甲木生助午火，且壬水见甲木先去生甲木再生火，就没有过多能量消耗午火。',
    content: '本身八字好，四柱相生，当官发财。'
  },
  {
    indexString: '0,8,0,10,0,2,0,10',
    narrate: '年支申金冲去日主寅木，有戌土加持，生金助杀，是地支不顾天干，属于地支不载就不会太好，四甲一寅，看着木强旺有根，但秋木休囚，冲去禄神，其根已拔，不做旺论。寅卯亥子运中衣食颇丰，一到庚辰运，杀之元神透出庚金透干了，四子俱伤破家不禄。寅卯运时比较祥和，庚辰得时候地支冲克不得安宁',
    content: '+40，50衣食颇丰，+60家破人亡'
  },
  {
    indexString: '4,0,4,6,4,10,4,6',
    narrate: '子衰午旺，把水消耗光了，天干不覆，已未运孤苦万状，庚申辛酉运引通戌土大得际遇，娶妻生子成家立业，金生水生财，壬戌运，水不通根，暗拱火局，一家五口皆亡。',
    content: '+10命苦，+20，30娶妻生子成家立业，+40家破人亡。'
  },
  {
    indexString: '4,8,4,6,4,10,4,6',
    narrate: '天干之气下降，地支之水有源，午火虽烈，究不能伤申金，用金明矣，申金不太怕火克，天干生申金食伤，食伤泄秀。',
    content: '前面顺遂，+40会难受些，+50还会好'
  },
  {
    indexString: '7,3,7,3,7,3,7,3',
    narrate: '辛金是很弱得金，无力克卯木，如果用财能好一点，但是运走得不行，己丑戊子运，印绶生扶，衣食无亏；一交丁亥，生火克金，即亡其师，所有微业，嫖赌扫尽而死。',
    content: '+20，30衣食无亏，+40不好了'
  },
  {
    indexString: '7,3,6,2,0,4,2,2',
    narrate: '地支有寅卯辰三会局，又在寅时相当得旺。年月两金临绝，庚辛都是绝，官杀无力。食伤和比劫都代表自己，在克官杀，官杀能治就能得到一些权力，早年土运生金破耗异常。官杀被治就得道了。丙戌运庚辛克尽变好，走到酉庚辛金生根了不好',
    content: '+20破耗，+40好起来了，+50又不行了'
  },
  {
    indexString: '6,2,6,4,0,2,3,3',
    narrate: '辰土还是要生七杀庚金的，庚金得载，力量足以克木，丁火虽透，非庚金之敌，丁火没有丙火旺，所以这个八字要用官杀，至甲申运，庚金禄旺暗冲寅木，一交丙运制杀，官运衰败',
    content: '+40运好高升，+60降职归田'
  },
  {
    indexString: '0,5,2,4,2,6,6,2',
    narrate: '火木比较旺，天干金水似乎无根，癸水在巳火上，庚金在寅木上，两个都相克能量不够，癸水坐巳为胎能量不够官星不旺，庚金坐寅为绝地能量也不够。好在戊土能生金，金还可用。癸水即庚金之喜神。水能润局庚金就有能力了。初运乙卯甲寅，金绝火生而水泄，孤苦不堪。一交癸丑北方阴湿之地，金水通根，又得巳丑拱金之妙，出外大得际遇。',
    content: '+10，20孤苦不堪。+30发财。'
  },
  {
    indexString: '4,2,1,1,2,2,6,2',
    narrate: '整体偏阳，走西北土金运会特别好，走水可能也会好，走水对这个局泄耗会多，所以走土金更好，但是大运寅卯辰巳午未东南阳暖运，生不逢时，一路东南木火之地，祖业破尽，遍历数省，奔驰不遇，至午运暗会劫局，身死',
    content: '一事无成。'
  },
  {
    indexString: '2,0,5,11,1,9,8,6',
    narrate: '此全酉、亥、子西北之阴寒。太阴寒了，又亥月为乙木之死地，酉金为乙木的绝地，所以木很难生长。对乙木来说地支的根气基本废掉了，所以丙火为用神，己土能稳固一下环境，水太旺根被泡坏，有土能稳固一下根气。且喜天干水木火土，各立门户，相生有情，不但四柱有情，而且行运光亨。阴阳配合的好一路顺遂。',
    content: '一路顺遂。'
  },
  {
    indexString: '5,11,2,0,1,1,8,6',
    narrate: '亥子丑三会水局，午火就废掉了，走的又是金水运，地支水更旺，，丙火本来就坐在子水上也没什么用，午火子午一冲也没什么用了。所以屈志芸窗，一贫如洗，克妻无子，至壬申运，丙火克尽而亡。',
    content: '比较笨的人，想的特别的做的比较少，一贫如洗，克妻无子，+40死。'
  },
  {
    indexString: '0,2,4,4,2,2,2,8',
    narrate: '丙火生于春天能量还是比较大的，寅木长生，又生在甲木的年份火特别旺的还是，印这么旺还是喜冲的，冲一冲还是有好处的，早年运走南方，起倒异常。木火为阳，早年走南方运阳太旺就不好了。巳午未运都是南方运，走到壬申癸酉就好了。壬申运寅申冲，把偏印冲掉七杀一来能量就强了，克去比肩，创业兴家。',
    content: '+10，20，30都不太好，+40，50，60就好了创业兴家。'
  },
  {
    indexString: '8,8,0,4,2,2,2,8',
    narrate: '此造之壬水，乃甲木之原神，断不可伤，壬水受伤，甲木必孤。凡独杀用印者，最忌制杀也。运走戊申伤壬水就不好了。运走丙午劫去申财，入学补廪登科。丁未合去壬水，三走春闱不捷。',
    content: '+20入学登科，+30不顺，+40身死'
  },
  {
    indexString: '5,5,7,7,8,6,1,5',
    narrate: '巳午未的南方火局。脆金难滋水源，火燥土焦很难生印星金。其意向必在午中丁火而合从矣。从弱了。己巳戊辰运，生金泄火，刑耗有之；丁卯丙寅，木火并旺，克尽辛金，经营发财巨万。属于走木火运从格了',
    content: '+20，30邢浩有之，+40，50从格遇火发财了'
  },
  {
    indexString: '5,1,2,0,3,11,6,0',
    narrate: '地支亥子丑三会北方水。天干火虚，无木生扶，又有湿土晦火，天衰极矣。夏天把旺神触起来了触霉头。戊寅岁，金绝火生，又合去亥水，必有大凶，果卒季夏。此地支官星乘旺，又类官方，天干无印，己土泄丙，未足帮身，此为天地合而从官也。甲戌运生火克水，刑丧破耗，家业已尽。癸酉壬申克尽丙火，助起财官，获利五万。财官旺了从格。辛未庚午取其火土帮身，比劫夺财，反致大凶。本来从格了又来帮身相克变大凶。',
    content: '+20有大凶家业尽，+30，40获利。+50，60大凶'
  },
  {
    indexString: '8,6,5,9,0,8,0,0',
    narrate: '甲申日元，生于八月，官杀当权，喜其午火紧制酉金，子水化其申金，所谓去官留煞。煞印相生，木凋金旺，印星为用，甲第联登。杀印相生的配置。又有伤官见官，大运亥子丑中印压制伤官能量，化了官杀。后又走比劫运比较好的。',
    content: '生来是个当官命'
  },
  {
    indexString: '8,4,5,9,0,8,0,0',
    narrate: '申子辰有水局像，大运庚戌水局被破，辰酉离得近不治官而变成七杀帮凶，子印就苦苦支撑，生在秋天的木本来就不太好过，酉月为胎地。能撑到晚年就还行。',
    content: '+10运就废了'
  },
  {
    indexString: '5,5,9,9,2,2,6,2',
    narrate: '此日主两坐长生，年支又逢禄旺，足以用官。。癸水官星被己土贴身一伤，喜得官临财位，尤妙巳酉拱金，虽伤官见官，但则己土之气已泄，而官星之根固矣。所以一生不遭凶险，名利两全也。',
    content: '一路顺遂'
  },
  {
    indexString: '9,11,9,11,2,4,0,6',
    narrate: '此官杀乘旺，原可畏也，然喜午时生食制煞，时干透甲，生火泄水。旺杀半化为印，衰木两遇长生，赖此木根愈固，上下情协，不诬也。白手成家发财数万。水生木，木生火，火有根，身杀两生。',
    content: '+20，30可能不顺，后面就好了'
  },
  {
    indexString: '0,2,6,6,1,3,2,0',
    narrate: '日主太旺，官星衰败无力，又无生助，乙亥运水木齐来，沦为乞丐。',
    content: '+50变乞丐'
  },
  {
    indexString: '1,1,5,3,1,11,8,6',
    narrate: '日主身旺，比劫克财，知己土之财，比肩夺去，丑土之财，卯木克破，午火食神，亥水克之。壬水盖之，无从引化，所谓上下无情也。初逢戊寅丁丑，财逢生助，遗业颇丰；一交丙子，冲去午火，一败而尽；乙亥运，妻子俱卖，削发为僧，又不守清规，冻饿而死。',
    content: '+10，20还行，+30后开始不行'
  },
  {
    indexString: '8,8,2,6,6,6,6,4',
    narrate: '此丙火之杀虽旺，壬水之根亦固，日主有比肩之助，辰土之生，谓身杀两停。用壬制杀，天干之同志者；地支之同志者，辰土也，一制一化，可谓有情。运喜金水之乡，仕途显赫，位至封疆。',
    content: '身杀两停，运也好，达官显贵'
  },
  {
    indexString: '8,6,2,6,8,8,4,2',
    narrate: '壬水逢申之生地，制杀有权，此则壬水坐午之绝地，敌杀无力；彼则时干比劫帮身，又可生水，此则时上枭神克水，而不能生食。所谓左右不能同志者也。日干相克混乱，不能相生相助。地支能量不足，官杀强旺。',
    content: '终身不发'
  },
  {
    indexString: '8,2,0,4,3,11,5,9',
    narrate: '年干壬水为始，是支亥水为终。官生印，印生身，食神发用吐秀，财得食之覆，官逢财星之生。伤官虽当令，印缓制之有情，年月不反背，日时不妒忌，始终得所。官印相生很强的。',
    content: '达官显贵'
  },
  {
    indexString: '4,10,6,8,9,11,1,3',
    narrate: '此造土生金，金生水，水生木，干支同流，但有相生之谊，而无争妒之风、戊戌中财星归库，官司清印正分明，食神吐秀逢生。',
    content: '好命顺遂'
  },
  {
    indexString: '0,0,2,2,5,5,7,7',
    narrate: '此造天干木生火，火生土，土生金，地支水生木，木生火，火生土，土生金。且由支而生干，从地支则以年支子水生寅木为始，至时干辛金为终；从天干亦以年支子水生甲木为始，至时干辛金为终。天地同流。正所谓始其所始，终其所终也。流通顺遂。',
    content: '长寿有财有官，夫妻和美子孙福旺，聪明绝顶'
  },
  {
    indexString: '0,6,3,3,0,6,3,3',
    narrate: '此造木火各半，两气成象，取丁火伤官，秀气为用。四柱金水全无，纯粹可观。巳运丁火临官，南宫奏捷，名高翰苑；庚运官杀混局，降知县。运至壬申癸酉金水就不好了',
    content: '原本八字可以，后面大运就逐渐不太好了'
  },
  {
    indexString: '3,3,1,5,3,3,1,5',
    narrate: '此亦木火各半，两气成象，非前伤官之比。日主是火，长于夏令，木从火势，格成炎上，更不宜见金运。火逢生助。巡抚浙江；至辛运水年，木火皆伤。故不能免祸。所谓“二人同心，可顺而不可逆也。”',
    content: '+40有祸'
  },
  {
    indexString: '2,6,4,10,2,6,4,10',
    narrate: '此火土各半，两气成象，取戌土食神，秀气为用。辛丑运湿土晦火，秀气流行，登乡榜；壬运壬年，赴会试，死于都中，盖水激丙火，则火灭也。如两戌换以两辰，不致燥烈，虽逢水运，亦不至大凶也。',
    content: '+30秀气流行，+40大凶'
  },
  {
    indexString: '4,10,7,9,4,10,7,9',
    narrate: '此土金各半，两气成象，取辛金伤官为用。喜其一路北方运，秀气流行，少年科甲，仕至黄堂；交丙破辛金之用，不禄。',
    content: ''
  },
  {
    indexString: '4,10,9,11,4,10,9,11',
    narrate: '此水土各半，两气成象，喜其通根燥土，财命有一。然气势稍寒，所以运至丙寅，寒逢阳，运登科甲，更妙亥中甲木暗生，仕至郡守，宦途平坦。',
    content: '一路顺遂'
  },
  {
    indexString: '9,11,5,7,9,11,5,7',
    narrate: '此土水相克，两气成象，纯杀无制，日主受伤。初走火土之乡，生助七杀，正是明月清风谁与共，高山流水少知音；一交乙卯，运转东方，制杀化权，得奇遇，飞升县令。',
    content: '+10，20，30比较憋闷，+40，50运来'
  },
  {
    indexString: '8,10,8,0,0,0,4,4',
    narrate: '水多木漂，好在有土，且有戊土，如果只有辰土，湿土见水则荡不能固根，又寒木无阳大运遇火便发迹',
    content: '+40，50发家'
  },
  {
    indexString: '4,2,1,3,0,4,7,7',
    narrate: '一点微金，成之不足，官星太弱不足为用，故书香不继，初运火土，不失化之情，财源通裕；至庚申辛酉，辛金得地，而成之异路，加捐仕至州牧；癸运生木泄金，不禄。',
    content: '前半生财源通裕，+50，60得官发迹，+70，80不幸'
  },
  {
    indexString: '9,7,1,3,0,10,1,11',
    narrate: '四柱无金以成之，五行无火以行之，再加亥时，癸水通根生劫，亥卯未全，助起劫刃猖狂。查其岁运，又无成地，以致祖业消磨，克妻无子。',
    content: '基本上废掉了'
  },
  {
    indexString: '0,2,3,3,0,4,2,2',
    narrate: '发泄菁华，少年科甲，早遂仕路之光；行财地，得过且过有食伤化劫之功；行金运，又得丙丁回克之能；交壬破局伤秀，降职归田不禄。初运食伤泄秀还可以，后遇金，金克食伤破局不禄。',
    content: '+50开始不顺'
  },
  {
    indexString: '5,7,3,1,4,0,5,7',
    narrate: '丑中辛金无从引出，且局中丁火三见，辛金暗伤，未得生化之妙，所以嗣息艰难。若天干透一庚辛，地支藏一申酉，必多子矣。从强格无食伤泄秀。也不至于官杀克冲，所以还行。',
    content: '还行'
  },
  {
    indexString: '2,2,0,6,2,10,1,7',
    narrate: '支全火局，木从火势，格成炎上。惜木旺克土，秀气有伤，书香难就，武甲出身，仕至副将。行申酉运，运亦有戌未之化，所以无咎；亥运，幸得未会寅合，不过降职；交庚子，干无食伤，支逢冲激，死在军中。食伤不强，庚子冲日主凶。',
    content: '+50下坡路，+60身死'
  },
  {
    indexString: '6,8,1,9,6,10,6,4',
    narrate: '此造天干乙庚化合，地支申酉戌全，格成从革，惜无水，肃杀之气太锐，不但书香不利，而且不能善终。行伍出身，官至参将，一交寅运，阵亡。盖局无食伤之故耳；又寅戌暗拱，触其旺神也。',
    content: ''
  },
  {
    indexString: '8,07,11,9,1,8,0',
    narrate: '地支亥子丑，干透壬癸辛，局成润下。喜行运不背，书得早遂；甲寅运气流行，登科发甲；乙卯宦途平坦，由县令而迁州牧；丙辰原局无食伤之化，群劫争财，不禄。',
    content: '早年从强格顺，后食伤泄秀可以，丙辰无木转化调和直接克水身死'
  },
  {
    indexString: '4,8,2,4,3,3,0,4',
    narrate: '丁卯日元，生于季春。伤官生财，嫌其木盛土虚，书香难就。土得其伤官化劫，使丙火无争财之意，所以运至庚申辛酉，承先人事业虽微，而自创规模颇大，财发十余万。日主不至于过衰。辰土泄去丙火，又伤官喜财不喜官杀，此八字无官杀，伤官生财。',
    content: '+40，50发财'
  },
  {
    indexString: '5,5,7,7,2,6,3,9',
    narrate: '此造火长夏天，支类南方，旺之极矣，火土伤官生财。格所嫌者，丁火羊刃透干，局中全无湿气，劫刃肆逞，祖业无恒，父母早亡，幼遭孤苦，中受饥寒。六旬之前，运走东南木火之地，妻财子禄，一字无成。至丑运，北方湿土，晦火生全，暗会金局，从此得际遇，立业发财，至七旬又买妾，连生二子。及甲子癸亥，北方水地，获利数万，寿至九旬。',
    content: '+60发财，+70，80发大财长寿'
  },
  {
    indexString: '3,1,6,10,6,0,0,8',
    narrate: '此秋金坚锐，官星虚脱，不能相制，财星临绝，何暇生官！初运土金，晦火生金，形伤破髦，无所不见；丁未丙午助起官星，家业鼎新；乙巳晚景优游，所谓伤之有功也。',
    content: ''
  },
  {
    indexString: '4,8,8,10,6,8,1,9',
    narrate: '此造乙从庚化，官星不见，支类西方，又坐禄旺，权在一人。从其强势，虽有壬，戊土紧克，不能引通泄其杀气。初交癸亥财喜如心一交丙寅、触其旺神，一败如灰，衣食难度，自缢而死。所谓泄之有益，伤之有害也。',
    content: '从强格，癸亥泄可以，丙寅克凶身死'
  },
  {
    indexString: '6,8,7,5,2,4,1,7',
    narrate: '庚辛重叠根深，独印受伤，弱可知矣。运至甲申乙酉，金得地，木无根，破耗异常；丙戌丁运，重振家声。此财多身弱，所谓帮之则有功也。',
    content: ''
  },
  {
    indexString: '8,0,9,1,2,6,8,4',
    narrate: '此造满局官星，日主孤弱，虽食伤未见，但丑辰皆湿土，能蓄水，不能止水。初交甲寅乙卯，化杀生身，早游泮水，财炡有余：后交丙辰，不但不能帮身，反受官杀回克，刑妻克子，家业耗散；申年暗拱杀局而亡。所谓助之则吉，帮之反害也。',
    content: ''
  },
  {
    indexString: '02,3,3,4,4,5,7',
    narrate: '此木方全，搭一未字为混，然无未字，则日主虚脱，且天干甲木透出作杀耑不作官，必要未字日主气贯，身杀两停，名利双辉。鼎甲出身，仕至极品，可知方混局之无害也。',
    content: ''
  },
  {
    indexString: '2,4,6,2,1,3,3,11',
    narrate: '此支类东方，火明木秀，最喜丙火紧克庚金之浊，然春初木嫩，必得亥时生助。为人风流潇洒，学问渊深。丁亥生木助火，采芹攀桂；巳运南宫报捷，名高翰苑；午运拱寅合卯，采梁栋于邓林，是难哲匠，搜琳琅于瑶圃；爰藉宗工；至酉，乙木无根，金得地，冲破东方秀气，犯事落职，若无亥水化之，岂能免大凶！',
    content: '身旺，丁酉运伤官见官冲凶，有印化官杀不至于太凶'
  },
  {
    indexString: '0,2,1,11,1,3,9,7',
    narrate: '此木局全，混一寅字，然四柱无金，其势从强，谓深得一方秀气。少年科第，惟庚辰辛巳运，虽有癸水之化，仍不免刑丧起倒，仕路蹭蹬。至六旬外，运走壬午癸未，由县令而迁司马。履黄堂而升观察，直如扬帆大海，谁能御之！由此观之，从强之木局，东南北运皆利，惟忌西方金运克破耳。',
    content: '从强格，遇火木火两旺，只怕遇金'
  },
  {
    indexString: '0,2,3,3,3,7,3,11',
    narrate: '此亦木局全，混一寅字，取丁火食神秀气，非前造从强论也。至巳运，丁火临官，登科发甲；庚午辛未，南方金败之地，不伤体用，仕途平坦；壬申，木火皆伤，破局，死于军中。前则从强，南北皆利；此则木火，西北有害。由此两造观之，局混方之无害也。',
    content: '有食伤泄秀不从强格，丁坐卯和丁坐未火都有损，丁卯有枭神夺食之意，丁未食伤泄秀，运走己巳火同根，木火两旺吉，身旺且伤官见官运走壬申见官大凶且木火皆伤'
  },
  {
    indexString: '0,2,3,3,1,11,9,7',
    narrate: '此方局齐来，得月干丁火独透，发泄菁英，何其妙也。惜乎时干癸水透露，通根亥支，紧伤丁火秀气，谓干头反复，所以一衿尚不能博，贫乏无子。设使癸水换一火土，名利皆遂矣。',
    content: '食伤泄秀但枭神夺食，食伤无力，运走食伤好，遇印通根不吉'
  },
  {
    indexString: '3,3,0,4,0,2,1,11',
    narrate: '此亦方局齐来，干头无水，丁火秀气流行，行运不甚反悖。中乡榜，仕至州牧，子多财旺，赋性仁慈，品行端方，寿越八旬，夫妇齐眉。所谓木主仁，仁者寿，格名曲直仁寿者，信斯言也。由此两造观之，干头反复与全顺得序者，天渊也。',
    content: '曲直仁寿格，食伤无力，运走庚子官杀无力不能冲克继续走曲直仁寿格，一路顺遂'
  },
  {
    indexString: '4,2,0,2,0,4,3,3',
    narrate: '此成方，干透元神，四柱不杂金水，时干丁火吐秀，纯粹可观。初中行运火土，中乡榜，出宰名区；惜木多火炽，丁火不中以泄之，所以运至庚申，不能免祸。',
    content: '从强，丁火泄秀不够，运至官杀凶'
  },
  {
    indexString: '9,3,2,4,0,4,2,2',
    narrate: '此造财旺提纲，丙食生助，当以财星为用，丙火为喜，癸水为忌。身旺用财，遗业十余万初年水木运，一败如灰：至辛亥运，火绝木生，水临旺，冻饿而死。',
    content: ''
  },
  {
    indexString: '7,7,7,3,1,7,3,11',
    narrate: '此乙木归垣，亥卯未全，木势旺盛，金气虚脱，最喜时透丁火，制煞为用。故初运土金之乡，奔驰未遇；至于亥运，生木制煞，军前效力，得县佐；丙戌运中帮丁克辛，升县令。此所谓强众而敌寡，势在去其寡，非煞旺宜制而推也。至酉运，煞逢禄旺，冲破木局不禄。',
    content: '官杀在卯地没有能量，木旺，又食伤制杀，'
  },
  {
    indexString: '7,7,7,3,1,7,4,2',
    narrate: '此乙木归垣，虽无全会，然寅时比亥之力量胜数倍矣。以大象观之，局中三土两金，似乎财生煞旺，不知卯旺提纲，支中皆木之根旺，非金之在地也。初运土金之乡，采芹食廪，家业丰裕：一交丁亥，制煞会局，刑妻克子，破耗异常，犯事革名，忧郁而死。',
    content: '财星透干，身杀两停，运至丁亥食伤制杀凶'
  },
  {
    indexString: '6,2,5,3,1,11,9,7',
    narrate: '此造正合本文成局，干透官星，左右皆空，四柱一无情致，用财则财会劫局，用官则官临绝地，用神无所着落，为人少恒一之志，多迁变之心，以致家业破耗。读书未就，而学医；医又不就，又学堪舆；自以为仲景再世，杨赖复生，而人终不信；又学巫，学易，学命，所学甚多，不能尽述。不但一无所就，而且财散人离，削发为僧矣。',
    content: '用财用官都不行，原局又没有食伤，没有用神，运也都不太行，没有可用的'
  },
  {
    indexString: '8,4,9,7,1,7,9,7',
    narrate: '此造支中三未通根，尚有余气，干透两癸，正三伏生寒，贴身生扶，亦通根身库。官星独发而清，癸水润土养金，生化不悖，财旺生官，中和纯粹。科甲出身，仕至藩臬，官境安和。',
    content: '财生官，官生印，印生身流通局'
  },
  {
    indexString: '5,1,8,8,3,7,2,6',
    narrate: '此造以大势观之，官得清地彼，何彼则富贵，此则困穷 ？不知此造无印，官紧克，午未虽是余气禄旺，丑中蓄水，暗伤午未之火，壬水逢生，又克丙火；更嫌己土一透，不能制水，反能晦火；兼之中运逢土，又泄火气，谓克泄交加。因之功名未遂，耗散资财，尚不免刑妻克子。细究皆己丑两字之患，幸格局顺正，气象不偏，将来运至木水之地，虽然屈抑于前，终必奋亨于后。',
    content: '食伤泄秀，官不旺，食伤克官，财克食伤，又无印流通，丑未相冲，无用神'
  },
  {
    indexString: '9,7,1,3,2,6,7,3',
    narrate: '此官清印正格，喜其未卯拱木，纯粹之象，故为人品超群，才华卓越，文望若高山北斗，品行似良玉精金。异印星太重，官星泄气，神有余而精不足，以致功名蹭蹬，纵有凌去之志，难遂青钱之选，还喜格正局清，财星逢合，虽然大材小用，究竟名利两全，仕路清高。施菁莪之雅化，振古木之人才也。',
    content: '印多，官杀若，运官杀通根，且财生官就好起来了'
  },
  {
    indexString: '7,3,2,8,9,3,8,10',
    narrate: '此印绶格，以申金为用，以丙火为病，以壬水沩药，中和纯粹，秋水通源。运至癸巳，金水逢生得助，科甲联登；壬辰药病相济，由部属出为郡守。盖辛卯庚寅盖头，逢金不能生火环印，名利两全也。',
    content: '天干辛壬癸三七贵人，地支又都是合局不打架'
  },
  {
    indexString: '7,3,2,8,9,3,0,2',
    narrate: '此亦以申金为用，以丙火为病，与前只换一寅字，不但有病无药，而且生助病神。彼则青钱万选，名利两全，此则机杼空抛，守株待兔。更嫌寅申遥冲，卯木助之，印绶反伤，木旺金缺，且月建乃六亲之位，未免分荆破斧，资财耗散。壬运帮身去病，财源稍裕；辛卯庚寅，东方无根之金，功名未能进取，家业不过小康。',
    content: '能力本来比较强，但是走了印运就不如走财运'
  },
  {
    indexString: '5,5,6,6,2,6,0,6',
    narrate: '此造俗论，丙午日支全三年，四柱滴水全无，中年又无水运，必作飞天禄马，名利双辉，不知此造午中己土，巳中庚金，元神透出年月两干，真火土伤官生财格。初交己巳戊辰，汇火生金，遗业颇丰；丁卯丙寅，土金喜用皆伤，连遭回禄三次，又克两妻四子，家业破尽；至乙丑运，北方湿土，晦火生金，又合化有情，经营获利，纳妾生子 ，重振家园；甲子癸亥，北方水地润土养金，发财数万若以飞天合禄论，大忌水运矣。',
    content: '丙寅太烈了'
  },
  {
    indexString: '3,1,9,3,1,3,5,3',
    narrate: '乙卯日，生于卯月卯时，旺之极矣，最喜丁火独发，泄其精英。惜癸水克丁，仍伤秀气，时干己土临绝，不能去其癸水，因之书香不继，初中运逢水木之地刑丧破耗，家业渐消：戊戌丁运，大遂经营之愿，发财巨万，若以飞天禄马论之，则戊戌运大破矣。',
    content: ''
  },
  {
    indexString: '3,7,9,1,0,4,0,10',
    narrate: '此造支全四库逢冲，俗作杂气财官也，不知丑未逢冲，不特官星受伤，而且冲去库根；日主坐下余气，亦是根盘，更嫌戌冲，微根巳气，财多身弱；且旺土愈冲愈旺，则癸水必伤。初运壬子辛水旺之地，荫疪有余；一交庚戌，财煞并旺，椿萱并逝，刑妻克子；己酉戊申土盖天干，使金不能生水，家业破尽，无子而亡。',
    content: '正印比较强，还有比肩帮身，就不喜走把印消耗掉的运，地支丑未冲辰戌冲，财冲各种是非不断，又财多破印，命局不好运也不好'
  },
  {
    indexString: '3,11,9,1,0,0,7,7',
    narrate: '甲子日元，生于丑月，支类北方；天干辛癸，官印元神发露，克去丁火，丑未遥隔；又水势乘权，不能冲丑，正得中和之象。所以土金水运，皆得生化之情，早游泮水，战胜秋闱。只因格局清寒，仕路未居显职，芹泮日长鸣孔铎，杏坛春暖奏虞弦也。前则逢冲，官印两伤，名利无成，此则不动，名成利遂。可知墓库逢冲必发者，谬也。',
    content: '亥子丑三会，让丑未冲不那么强了，癸丑财克印，没有太大成就本本分分做事'
  },
  {
    indexString: '2,2,0,6,2,6,9,5',
    narrate: '此火长夏令，月支坐刃，年支逢生，时支得禄，年月两支，又透甲丙，烈火焚木，旺之极矣，一点癸水熬干，只得从其强势。运逢木火土，财喜频增；申酉运中 ，刑耗多端；至亥运，激火之烈，家业破尽而亡。所谓旺极者，抑之反激而有害也。',
    content: '从强，怕官来克，运走官凶'
  },
  {
    indexString: '4,2,6,8,2,8,2,8',
    narrate: '丙火生于初秋，秋金乘令，二申冲去一寅，丙火之根已拔，比肩亦不能为力。年月两干，又透土金，只得从其弱势，顺财之性，以比肩为病。故运至水旺之地，制去比肩，事业巍峨：丙寅帮身，刑丧破髦。所谓弱极者扶之，徒劳无功，反有害也。此等格局颇多，以俗论之前造必以金水为用，此造必以木为用，以致吉凶颠倒，反归咎于命理之无凭故特书两造为后证云。',
    content: '财旺，还是从强，印被克无用，运再克去比肩即可从强'
  },
  {
    indexString: '9,9,0,0,2,2,4,10',
    narrate: '此造以甲木为精，衰木得水滋，而逢寅禄为精足，以戊土为神，坐戌通根，寅戌拱之为神旺。官生印，印生身，坐下长生为气贯流通，生化五行俱足。左右上下情协不悖，官来能挡，劫来有官，食来有印，东西南北之运，皆可行也，所以一生富贵福寿 ，可谓美矣。',
    content: '财生官，官生印，印生日主，又有食伤泄秀还能制官，流通得很好，运基本都能协调'
  },
  {
    indexString: '9,7,1,3,2,4,6,2',
    narrate: '此造以大势观之，官印相生，偏财时遇，五行不缺，四柱纯粹，俨然贵格，不如财官两字休囚，又遥隔不能相顾，支全寅、卯、辰。春土克尽，不能生金，金临绝地，不能生水，水之气尽泄于木，木之势愈旺而火炽，火炽则气毙，气毙则神枯。行运北方，又伤丙火之气，反助取木之精；即逢金运，所谓过于有余，损之反角其触，以致终身碌碌 ，名利无成出。',
    content: '官星入木，财星坐绝地，财官不能为用，财印打架，整体比较别扭'
  },
  {
    indexString: '4,10,1,1,2,4,5,1',
    narrate: '此四柱皆土，命主元神，泄尽月干，乙木凋枯，所谓精气枯索。运逢壬戌，本主受伤；年逢辛未，紧克乙木，卒于九月患弱症而亡。此造运用逆行，大抵是右命。',
    content: '泄得太过'
  },
  {
    indexString: '0,10,2,2,4,2,2,4',
    narrate: '戊寅日元，生于立春十五日后，正当甲木司令，地支两寅紧克辰戌之土，天干甲木，又制日干之戊，似乎煞旺身弱。然喜无金，则日元之气不泄，更妙无水，则丙火之印不坏，尤羡铁身透丙，化杀生身。由甲傍而悬青绶，从副尹以跻黄堂，名利双收也。',
    content: '身弱，杀印相生，没有财克印，没有水泄土，很好'
  },
  {
    indexString: '0,10,2,2,4,4,6,8',
    narrate: '戊辰日元，生于立春后六日，正戊土司令，月透丙火，生化有情，日支坐辰，通根身旺，又得食神制杀。俗论比之，胜于前造，不知嫩木寒土皆喜火，况杀既化，不宜再制。所嫌者，申时不但日主泄气，而且丙火临绝，以致书香难遂，一生起倒不宁，半世刑丧不免也。',
    content: '格局混乱，本来杀印相生，但又枭神夺食，不知道干什么好，食神又克官杀，很乱'
  },
  {
    indexString: '0,4,3,3,0,0,4,4',
    narrate: '甲子日生卯月，地支两辰，是木之余气也，又辰卯东方，子辰拱水，木太旺者似金也，以丁火为用。至巳运，丁火临旺，名列宫墙；庚辛两运，南方截脚之金，虽有刑耗，而无大患；未运克去子水，食廪天储；午运子水冲克，秋闱失意；壬申运金水齐来，刑妻克子，破耗多端；癸运不禄。',
    content: '日主身强，用食伤泄秀，火为用神，运遇金伤根有所破耗'
  },
  {
    indexString: '9,3,1,3,0,2,1,11',
    narrate: '此造四支皆木，又逢水生，六木两水，别无他气。木旺极者，似火也，出身祖业本丰。惟丑运刑伤，壬子水势乘旺，辛亥金不通根，支逢水旺，此二十年经营，获利数万；一交庚戌，土金并旺，破财而亡。',
    content: '从强格，怕官杀'
  },
  {
    indexString: '1,1,0,8,0,8,7,7',
    narrate: '此造地支土金，木无盘根之处，时干辛金，元神发透，木太衰者，似水也，初运癸未壬午，生木制金，刑丧早见，荫疪难丰；辛巳庚辰，金逢生地，白手发财数万；己卯运土无根，木得地，遭回禄，破财万余；至寅而亡 。',
    content: '从弱了，运把官杀克了就不好了'
  },
  {
    indexString: '5,5,5,5,1,9,2,10',
    narrate: '此造地支皆逢克泄，天干又透火土，全无水气。木衰极者，似土也。初交戊辰丁运，获丰厚之荫疪，美景良多；卯运椿萱并谢；丙运大遂经营之愿，获利万金；寅运克妻破财，又遭回禄；乙丑支全金局，火土两泄，家业耗散；甲子北方水地，不禄宜矣。',
    content: '从弱，运至比劫印帮身则凶'
  },
  {
    indexString: '1,1,8,6,2,10,0,6',
    narrate: '此丙戌日元，月时两刃，壬水无根，又逢木泄。火太旺者，似水也。初运庚辰辛巳，金逢生地，孔怀无辅助之人，亲党少知心之辈；己卯得际遇，戊寅全会火局，及丁丑二十年，发财四五万，至子运而亡。',
    content: '从强了，杀为病，运至杀凶，或从印和食伤角度看也可以杀也是凶'
  },
  {
    indexString: '4,2,3,5,2,2,0,6',
    narrate: '此造丙火生孟夏，地支两坐长生而逢禄旺。火旺极者，似土也。初运虽不逢木，喜其南方火地，遗绪丰盈，读书过目成育；一交庚运，即弃诗书，受嬉好游，挥金如土；申运家破身亡。此造若逢木运，名利两全也。',
    content: '从强，金破坏命局走不到后面'
  },
  {
    indexString: '7,5,3,9,3,9,7,1',
    narrate: '丁火生于八月，秋金秉令，又全金局。火衰者，似木也。初运己未甲午，火木并旺，骨肉如同画饼，六亲亦是浮云；一交癸巳，干透水，支拱金，出外经营，大得际遇；壬辰运中，发财十余万。',
    content: '金旺，月支金又三合金局，有从财的像，助财则顺'
  },
  {
    indexString: '7,11,8,4,2,8,5,11',
    narrate: '此财生杀，杀功身，丙临申，申辰拱水。火衰极者，似金也。初运辛卯庚寅，东方木地，萱椿凋谢，祖业无恒；至己丑运，出外经营，青蚨衬辇，白镪随舆；及戊子二十年，春风吹枊，红绫易公子之裳，杏露沾衣，膏雨沐王孙之袖。所谓有其运，必得其福也。',
    content: '从官杀，再走官杀就很旺'
  },
  {
    indexString: '4,4,4,6,4,8,5,7',
    narrate: '此造重重厚土，生于夏令，土太旺者，似木也，其用在金。庚申运，早采芹香；辛酉运辛丑年，饮鹿鸣，宴琼林，云程直上；壬戌运，刑丧挫折，丙午而亡。',
    content: '用食伤泄秀'
  },
  {
    indexString: '4,10,2,4,5,5,5,5',
    narrate: '此造四柱火土，全无克泄。土旺极者，似金也。初运南方，遗业丰盈，午运入泮，己未棘闱，拔而不举；一交庚申，青蚨化蝶，家业渐消；辛酉财若春后霜雪，事业萧条；壬运克丙不禄。',
    content: '从强，运走食伤有所损益'
  },
  {
    indexString: '8,4,7,11,4,0,9,1',
    narrate: '此造支类北方，水势汪洋，天干又透金水。土太衰者，似火也。运至甲寅乙卯，干支皆木，名成利遂；一交丙运，刑妻克子，破耗多端；至于巳运，岁运火土，暗伤体用，得风疾而亡。',
    content: '从弱，运至印比凶'
  },
  {
    indexString: '9,9,0,0,4,0,8,0',
    narrate: '此四柱皆水，又得金生。土衰极者，似水也。初运癸亥，平宁之境；壬戌水无根，土得地，刑丧破耗，家业消亡；辛酉庚申二十年，大得际遇，白手发财十余万；己未运破去数万，寿亦在未而止。',
    content: '从弱'
  },
  {
    indexString: '8,8,5,9,6,0,6,4',
    narrate: '此造秋金秉令，木火全无。金太旺者，似火也。亥运壬水坐禄，早游泮水，壬子运用神临旺，撞破烟楼，高攀月桂；癸丑合去壬水旺地，囊内青蚨成蝶舞，枝上子规月下啼；甲寅乙卯，尚有制土卫水之功，仁路清高，枫叶未应毡共冷，梅开早觉笔先香。',
    content: '身食两旺，不喜印'
  },
  {
    indexString: '6,8,1,9,6,10,6,4',
    narrate: '此造支类西方，又逢厚土，金旺极者，似水也。初运火，祖业无恒；至戊子运获厚利，纳房出仁已丑庚运，名利皆遂；一交寅运，犯事落职，大破财利；至卯不禄。',
    content: '从强，怕冲'
  },
  {
    indexString: '5,3,6,6,7,3,0,6',
    narrate: '辛金生于促夏，地支皆逢财杀。金太衰者，似土也。初运己巳戊辰，晦火生金，求名多滞，作事少成；一交丁卯，木火并旺，如枯苗得雨，勃然而兴，似鸿毛遇风，飘然而起，家业丰裕交丑生金泄火，不禄。',
    content: '从弱，走财杀'
  },
  {
    indexString: '5,11,3,3,6,2,2,0',
    narrate: '此造木旺乘权，又得水生，四面皆逢财杀。金衰极者，似木也。所以乙丑运中，土金暗旺，家业破尽；至甲子运，北方水旺，财源通裕；癸亥出仁，名利两全壬戌水临绝地， 罢职而归。',
    content: '从弱'
  },
  {
    indexString: '8,2,7,11,8,0,7,1',
    narrate: '此造壬水生于孟冬，支类北方，干皆金水。水太旺者，似土也，喜其寅木吐秀。至甲寅运，早遂青云之志，可谓才藻翩翩，辉映杏坛桃李，文思弈弈，光腾药笼参芩，乙卯运官途顺遂，交丙而亡。',
    content: '有从强的像，运走食伤泄秀可，运走官杀凶'
  },
  {
    indexString: '9,11,9,11,8,0,6,0',
    narrate: '此造四柱皆水，一无克泄，其势冲奔，不可遏也。初运壬戌，支逢土旺，早见刑丧；辛酉庚申，干支皆金，所谓月印午江银作浪 ，门临五福锦铺花；交己未，妻子皆伤，家业破尽；戌午运，贫乏不堪，忧郁而卒。',
    content: '从强，运走已未破格'
  },
  {
    indexString: '',
    narrate: '',
    content: ''
  },
]