export interface NumerologyData {
  indexString: string;
  narrate: string;
  content: string;
}

type NumerologyDatabaseType = NumerologyData[];

export const NumerologyDatabase: NumerologyDatabaseType = [
  {
    indexString: '6,8,8,6,7,9,9,5',
    narrate: '谓午火真神得用理应名利双收，但五行缺木，五行无木，金过多，壬午癸巳又伤官见官火被消耗没能量，不能克金，而且虽有巳火助午，但是巳酉拱金，巳被消耗不能助午。申中又得长生使壬水更强克制午火。所以申酉两运破耗异常。丙戌运中助起用神大得际遇，一交亥运，壬水得禄，癸水临旺，火气克尽，家婆身亡',
    content: '永远不知道自己想干什么，+40大得际遇，+50家破身亡。'
  },
  {
    indexString: '6,8,8,6,7,9,0,6',
    narrate: '金过旺，用午中丁火来杀之，壬午中壬水消耗午火，妙在甲午甲木生助午火，且壬水见甲木先去生甲木再生火，就没有过多能量消耗午火。',
    content: '本身八字好，四柱相生，当官发财。'
  },
  {
    indexString: '0,8,0,10,0,2,0,10',
    narrate: '年支申金冲去日主寅木，有戌土加持，生金助杀，是地支不顾天干，属于地支不载就不会太好，四甲一寅，看着木强旺有根，但秋木休囚，冲去禄神，其根已拔，不做旺论。寅卯亥子运中衣食颇丰，一到庚辰运，杀之元神透出庚金透干了，四子俱伤破家不禄。寅卯运时比较祥和，庚辰得时候地支冲克不得安宁',
    content: '+40，50衣食颇丰，+60家破人亡'
  },
  {
    indexString: '4,0,4,6,4,10,4,6',
    narrate: '子衰午旺，把水消耗光了，天干不覆，已未运孤苦万状，庚申辛酉运引通戌土大得际遇，娶妻生子成家立业，金生水生财，壬戌运，水不通根，暗拱火局，一家五口皆亡。',
    content: '+10命苦，+20，30娶妻生子成家立业，+40家破人亡。'
  },
  {
    indexString: '4,8,4,6,4,10,4,6',
    narrate: '天干之气下降，地支之水有源，午火虽烈，究不能伤申金，用金明矣，申金不太怕火克，天干生申金食伤，食伤泄秀。',
    content: '前面顺遂，+40会难受些，+50还会好'
  },
  {
    indexString: '7,3,7,3,7,3,7,3',
    narrate: '辛金是很弱得金，无力克卯木，如果用财能好一点，但是运走得不行，己丑戊子运，印绶生扶，衣食无亏；一交丁亥，生火克金，即亡其师，所有微业，嫖赌扫尽而死。',
    content: '+20，30衣食无亏，+40不好了'
  },
  {
    indexString: '7,3,6,2,0,4,2,2',
    narrate: '地支有寅卯辰三会局，又在寅时相当得旺。年月两金临绝，庚辛都是绝，官杀无力。食伤和比劫都代表自己，在克官杀，官杀能治就能得到一些权力，早年土运生金破耗异常。官杀被治就得道了。丙戌运庚辛克尽变好，走到酉庚辛金生根了不好',
    content: '+20破耗，+40好起来了，+50又不行了'
  },
  {
    indexString: '6,2,6,4,0,2,3,3',
    narrate: '辰土还是要生七杀庚金的，庚金得载，力量足以克木，丁火虽透，非庚金之敌，丁火没有丙火旺，所以这个八字要用官杀，至甲申运，庚金禄旺暗冲寅木，一交丙运制杀，官运衰败',
    content: '+40运好高升，+60降职归田'
  },
  {
    indexString: '0,5,2,4,2,6,6,2',
    narrate: '火木比较旺，天干金水似乎无根，癸水在巳火上，庚金在寅木上，两个都相克能量不够，癸水坐巳为胎能量不够官星不旺，庚金坐寅为绝地能量也不够。好在戊土能生金，金还可用。癸水即庚金之喜神。水能润局庚金就有能力了。初运乙卯甲寅，金绝火生而水泄，孤苦不堪。一交癸丑北方阴湿之地，金水通根，又得巳丑拱金之妙，出外大得际遇。',
    content: '+10，20孤苦不堪。+30发财。'
  },
  {
    indexString: '4,2,1,1,2,2,6,2',
    narrate: '整体偏阳，走西北土金运会特别好，走水可能也会好，走水对这个局泄耗会多，所以走土金更好，但是大运寅卯辰巳午未东南阳暖运，生不逢时，一路东南木火之地，祖业破尽，遍历数省，奔驰不遇，至午运暗会劫局，身死',
    content: '一事无成。'
  },
  {
    indexString: '2,0,5,11,1,9,8,6',
    narrate: '此全酉、亥、子西北之阴寒。太阴寒了，又亥月为乙木之死地，酉金为乙木的绝地，所以木很难生长。对乙木来说地支的根气基本废掉了，所以丙火为用神，己土能稳固一下环境，水太旺根被泡坏，有土能稳固一下根气。且喜天干水木火土，各立门户，相生有情，不但四柱有情，而且行运光亨。阴阳配合的好一路顺遂。',
    content: '一路顺遂。'
  },
  {
    indexString: '5,11,2,0,1,1,8,6',
    narrate: '亥子丑三会水局，午火就废掉了，走的又是金水运，地支水更旺，，丙火本来就坐在子水上也没什么用，午火子午一冲也没什么用了。所以屈志芸窗，一贫如洗，克妻无子，至壬申运，丙火克尽而亡。',
    content: '比较笨的人，想的特别的做的比较少，一贫如洗，克妻无子，+40死。'
  },
  {
    indexString: '0,2,4,4,2,2,2,8',
    narrate: '丙火生于春天能量还是比较大的，寅木长生，又生在甲木的年份火特别旺的还是，印这么旺还是喜冲的，冲一冲还是有好处的，早年运走南方，起倒异常。木火为阳，早年走南方运阳太旺就不好了。巳午未运都是南方运，走到壬申癸酉就好了。壬申运寅申冲，把偏印冲掉七杀一来能量就强了，克去比肩，创业兴家。',
    content: '+10，20，30都不太好，+40，50，60就好了创业兴家。'
  },
  {
    indexString: '8,8,0,4,2,2,2,8',
    narrate: '此造之壬水，乃甲木之原神，断不可伤，壬水受伤，甲木必孤。凡独杀用印者，最忌制杀也。运走戊申伤壬水就不好了。运走丙午劫去申财，入学补廪登科。丁未合去壬水，三走春闱不捷。',
    content: '+20入学登科，+30不顺，+40身死'
  },
  {
    indexString: '5,5,7,7,8,6,1,5',
    narrate: '巳午未的南方火局。脆金难滋水源，火燥土焦很难生印星金。其意向必在午中丁火而合从矣。从弱了。己巳戊辰运，生金泄火，刑耗有之；丁卯丙寅，木火并旺，克尽辛金，经营发财巨万。属于走木火运从格了',
    content: '+20，30邢浩有之，+40，50从格遇火发财了'
  },
  {
    indexString: '5,1,2,0,3,11,6,0',
    narrate: '地支亥子丑三会北方水。天干火虚，无木生扶，又有湿土晦火，天衰极矣。夏天把旺神触起来了触霉头。戊寅岁，金绝火生，又合去亥水，必有大凶，果卒季夏。此地支官星乘旺，又类官方，天干无印，己土泄丙，未足帮身，此为天地合而从官也。甲戌运生火克水，刑丧破耗，家业已尽。癸酉壬申克尽丙火，助起财官，获利五万。财官旺了从格。辛未庚午取其火土帮身，比劫夺财，反致大凶。本来从格了又来帮身相克变大凶。',
    content: '+20有大凶家业尽，+30，40获利。+50，60大凶'
  },
  {
    indexString: '8,6,5,9,0,8,0,0',
    narrate: '甲申日元，生于八月，官杀当权，喜其午火紧制酉金，子水化其申金，所谓去官留煞。煞印相生，木凋金旺，印星为用，甲第联登。杀印相生的配置。又有伤官见官，大运亥子丑中印压制伤官能量，化了官杀。后又走比劫运比较好的。',
    content: '生来是个当官命'
  },
  {
    indexString: '8,4,5,9,0,8,0,0',
    narrate: '申子辰有水局像，大运庚戌水局被破，辰酉离得近不治官而变成七杀帮凶，子印就苦苦支撑，生在秋天的木本来就不太好过，酉月为胎地。能撑到晚年就还行。',
    content: '+10运就废了'
  },
  {
    indexString: '5,5,9,9,2,2,6,2',
    narrate: '此日主两坐长生，年支又逢禄旺，足以用官。。癸水官星被己土贴身一伤，喜得官临财位，尤妙巳酉拱金，虽伤官见官，但则己土之气已泄，而官星之根固矣。所以一生不遭凶险，名利两全也。',
    content: '一路顺遂'
  },
  {
    indexString: '9,11,9,11,2,4,0,6',
    narrate: '此官杀乘旺，原可畏也，然喜午时生食制煞，时干透甲，生火泄水。旺杀半化为印，衰木两遇长生，赖此木根愈固，上下情协，不诬也。白手成家发财数万。水生木，木生火，火有根，身杀两生。',
    content: '+20，30可能不顺，后面就好了'
  },
  {
    indexString: '0,2,6,6,1,3,2,0',
    narrate: '日主太旺，官星衰败无力，又无生助，乙亥运水木齐来，沦为乞丐。',
    content: '+50变乞丐'
  },
  {
    indexString: '1,1,5,3,1,11,8,6',
    narrate: '日主身旺，比劫克财，知己土之财，比肩夺去，丑土之财，卯木克破，午火食神，亥水克之。壬水盖之，无从引化，所谓上下无情也。初逢戊寅丁丑，财逢生助，遗业颇丰；一交丙子，冲去午火，一败而尽；乙亥运，妻子俱卖，削发为僧，又不守清规，冻饿而死。',
    content: '+10，20还行，+30后开始不行'
  },
  {
    indexString: '8,8,2,6,6,6,6,4',
    narrate: '此丙火之杀虽旺，壬水之根亦固，日主有比肩之助，辰土之生，谓身杀两停。用壬制杀，天干之同志者；地支之同志者，辰土也，一制一化，可谓有情。运喜金水之乡，仕途显赫，位至封疆。',
    content: '身杀两停，运也好，达官显贵'
  },
  {
    indexString: '8,6,2,6,8,8,4,2',
    narrate: '壬水逢申之生地，制杀有权，此则壬水坐午之绝地，敌杀无力；彼则时干比劫帮身，又可生水，此则时上枭神克水，而不能生食。所谓左右不能同志者也。日干相克混乱，不能相生相助。地支能量不足，官杀强旺。',
    content: '终身不发'
  },
  {
    indexString: '8,2,0,4,3,11,5,9',
    narrate: '年干壬水为始，是支亥水为终。官生印，印生身，食神发用吐秀，财得食之覆，官逢财星之生。伤官虽当令，印缓制之有情，年月不反背，日时不妒忌，始终得所。官印相生很强的。',
    content: '达官显贵'
  },
  {
    indexString: '4,10,6,8,9,11,1,3',
    narrate: '此造土生金，金生水，水生木，干支同流，但有相生之谊，而无争妒之风、戊戌中财星归库，官司清印正分明，食神吐秀逢生。',
    content: '好命顺遂'
  },
  {
    indexString: '0,0,2,2,5,5,7,7',
    narrate: '此造天干木生火，火生土，土生金，地支水生木，木生火，火生土，土生金。且由支而生干，从地支则以年支子水生寅木为始，至时干辛金为终；从天干亦以年支子水生甲木为始，至时干辛金为终。天地同流。正所谓始其所始，终其所终也。流通顺遂。',
    content: '长寿有财有官，夫妻和美子孙福旺，聪明绝顶'
  },
  {
    indexString: '0,6,3,3,0,6,3,3',
    narrate: '此造木火各半，两气成象，取丁火伤官，秀气为用。四柱金水全无，纯粹可观。巳运丁火临官，南宫奏捷，名高翰苑；庚运官杀混局，降知县。运至壬申癸酉金水就不好了',
    content: '原本八字可以，后面大运就逐渐不太好了'
  },
  {
    indexString: '3,3,1,5,3,3,1,5',
    narrate: '此亦木火各半，两气成象，非前伤官之比。日主是火，长于夏令，木从火势，格成炎上，更不宜见金运。火逢生助。巡抚浙江；至辛运水年，木火皆伤。故不能免祸。所谓“二人同心，可顺而不可逆也。”',
    content: '+40有祸'
  },
  {
    indexString: '2,6,4,10,2,6,4,10',
    narrate: '此火土各半，两气成象，取戌土食神，秀气为用。辛丑运湿土晦火，秀气流行，登乡榜；壬运壬年，赴会试，死于都中，盖水激丙火，则火灭也。如两戌换以两辰，不致燥烈，虽逢水运，亦不至大凶也。',
    content: '+30秀气流行，+40大凶'
  },
  {
    indexString: '4,10,7,9,4,10,7,9',
    narrate: '此土金各半，两气成象，取辛金伤官为用。喜其一路北方运，秀气流行，少年科甲，仕至黄堂；交丙破辛金之用，不禄。',
    content: ''
  },
  {
    indexString: '4,10,9,11,4,10,9,11',
    narrate: '此水土各半，两气成象，喜其通根燥土，财命有一。然气势稍寒，所以运至丙寅，寒逢阳，运登科甲，更妙亥中甲木暗生，仕至郡守，宦途平坦。',
    content: '一路顺遂'
  },
  {
    indexString: '9,11,5,7,9,11,5,7',
    narrate: '此土水相克，两气成象，纯杀无制，日主受伤。初走火土之乡，生助七杀，正是明月清风谁与共，高山流水少知音；一交乙卯，运转东方，制杀化权，得奇遇，飞升县令。',
    content: '+10，20，30比较憋闷，+40，50运来'
  },
  {
    indexString: '8,10,8,0,0,0,4,4',
    narrate: '水多木漂，好在有土，且有戊土，如果只有辰土，湿土见水则荡不能固根，又寒木无阳大运遇火便发迹',
    content: '+40，50发家'
  },
  {
    indexString: '4,2,1,3,0,4,7,7',
    narrate: '一点微金，成之不足，官星太弱不足为用，故书香不继，初运火土，不失化之情，财源通裕；至庚申辛酉，辛金得地，而成之异路，加捐仕至州牧；癸运生木泄金，不禄。',
    content: '前半生财源通裕，+50，60得官发迹，+70，80不幸'
  },
  {
    indexString: '9,7,1,3,0,10,1,11',
    narrate: '四柱无金以成之，五行无火以行之，再加亥时，癸水通根生劫，亥卯未全，助起劫刃猖狂。查其岁运，又无成地，以致祖业消磨，克妻无子。',
    content: '基本上废掉了'
  },
  {
    indexString: '0,2,3,3,0,4,2,2',
    narrate: '发泄菁华，少年科甲，早遂仕路之光；行财地，得过且过有食伤化劫之功；行金运，又得丙丁回克之能；交壬破局伤秀，降职归田不禄。初运食伤泄秀还可以，后遇金，金克食伤破局不禄。',
    content: '+50开始不顺'
  },
  {
    indexString: '5,7,3,1,4,0,5,7',
    narrate: '丑中辛金无从引出，且局中丁火三见，辛金暗伤，未得生化之妙，所以嗣息艰难。若天干透一庚辛，地支藏一申酉，必多子矣。从强格无食伤泄秀。也不至于官杀克冲，所以还行。',
    content: '还行'
  },
  {
    indexString: '2,2,0,6,2,10,1,7',
    narrate: '支全火局，木从火势，格成炎上。惜木旺克土，秀气有伤，书香难就，武甲出身，仕至副将。行申酉运，运亦有戌未之化，所以无咎；亥运，幸得未会寅合，不过降职；交庚子，干无食伤，支逢冲激，死在军中。食伤不强，庚子冲日主凶。',
    content: '+50下坡路，+60身死'
  },
  {
    indexString: '6,8,1,9,6,10,6,4',
    narrate: '此造天干乙庚化合，地支申酉戌全，格成从革，惜无水，肃杀之气太锐，不但书香不利，而且不能善终。行伍出身，官至参将，一交寅运，阵亡。盖局无食伤之故耳；又寅戌暗拱，触其旺神也。',
    content: ''
  },
  {
    indexString: '8,07,11,9,1,8,0',
    narrate: '地支亥子丑，干透壬癸辛，局成润下。喜行运不背，书得早遂；甲寅运气流行，登科发甲；乙卯宦途平坦，由县令而迁州牧；丙辰原局无食伤之化，群劫争财，不禄。',
    content: '早年从强格顺，后食伤泄秀可以，丙辰无木转化调和直接克水身死'
  },
  {
    indexString: '4,8,2,4,3,3,0,4',
    narrate: '丁卯日元，生于季春。伤官生财，嫌其木盛土虚，书香难就。土得其伤官化劫，使丙火无争财之意，所以运至庚申辛酉，承先人事业虽微，而自创规模颇大，财发十余万。日主不至于过衰。辰土泄去丙火，又伤官喜财不喜官杀，此八字无官杀，伤官生财。',
    content: '+40，50发财'
  },
  {
    indexString: '5,5,7,7,2,6,3,9',
    narrate: '此造火长夏天，支类南方，旺之极矣，火土伤官生财。格所嫌者，丁火羊刃透干，局中全无湿气，劫刃肆逞，祖业无恒，父母早亡，幼遭孤苦，中受饥寒。六旬之前，运走东南木火之地，妻财子禄，一字无成。至丑运，北方湿土，晦火生全，暗会金局，从此得际遇，立业发财，至七旬又买妾，连生二子。及甲子癸亥，北方水地，获利数万，寿至九旬。',
    content: '+60发财，+70，80发大财长寿'
  },
  {
    indexString: '3,1,6,10,6,0,0,8',
    narrate: '此秋金坚锐，官星虚脱，不能相制，财星临绝，何暇生官！初运土金，晦火生金，形伤破髦，无所不见；丁未丙午助起官星，家业鼎新；乙巳晚景优游，所谓伤之有功也。',
    content: ''
  },
  {
    indexString: '4,8,8,10,6,8,1,9',
    narrate: '此造乙从庚化，官星不见，支类西方，又坐禄旺，权在一人。从其强势，虽有壬，戊土紧克，不能引通泄其杀气。初交癸亥财喜如心一交丙寅、触其旺神，一败如灰，衣食难度，自缢而死。所谓泄之有益，伤之有害也。',
    content: '从强格，癸亥泄可以，丙寅克凶身死'
  },
  {
    indexString: '6,8,7,5,2,4,1,7',
    narrate: '庚辛重叠根深，独印受伤，弱可知矣。运至甲申乙酉，金得地，木无根，破耗异常；丙戌丁运，重振家声。此财多身弱，所谓帮之则有功也。',
    content: ''
  },
  {
    indexString: '8,0,9,1,2,6,8,4',
    narrate: '此造满局官星，日主孤弱，虽食伤未见，但丑辰皆湿土，能蓄水，不能止水。初交甲寅乙卯，化杀生身，早游泮水，财炡有余：后交丙辰，不但不能帮身，反受官杀回克，刑妻克子，家业耗散；申年暗拱杀局而亡。所谓助之则吉，帮之反害也。',
    content: ''
  },
  {
    indexString: '02,3,3,4,4,5,7',
    narrate: '此木方全，搭一未字为混，然无未字，则日主虚脱，且天干甲木透出作杀耑不作官，必要未字日主气贯，身杀两停，名利双辉。鼎甲出身，仕至极品，可知方混局之无害也。',
    content: ''
  },
  {
    indexString: '2,4,6,2,1,3,3,11',
    narrate: '此支类东方，火明木秀，最喜丙火紧克庚金之浊，然春初木嫩，必得亥时生助。为人风流潇洒，学问渊深。丁亥生木助火，采芹攀桂；巳运南宫报捷，名高翰苑；午运拱寅合卯，采梁栋于邓林，是难哲匠，搜琳琅于瑶圃；爰藉宗工；至酉，乙木无根，金得地，冲破东方秀气，犯事落职，若无亥水化之，岂能免大凶！',
    content: '身旺，丁酉运伤官见官冲凶，有印化官杀不至于太凶'
  },
  {
    indexString: '0,2,1,11,1,3,9,7',
    narrate: '此木局全，混一寅字，然四柱无金，其势从强，谓深得一方秀气。少年科第，惟庚辰辛巳运，虽有癸水之化，仍不免刑丧起倒，仕路蹭蹬。至六旬外，运走壬午癸未，由县令而迁司马。履黄堂而升观察，直如扬帆大海，谁能御之！由此观之，从强之木局，东南北运皆利，惟忌西方金运克破耳。',
    content: '从强格，遇火木火两旺，只怕遇金'
  },
  {
    indexString: '0,2,3,3,3,7,3,11',
    narrate: '此亦木局全，混一寅字，取丁火食神秀气，非前造从强论也。至巳运，丁火临官，登科发甲；庚午辛未，南方金败之地，不伤体用，仕途平坦；壬申，木火皆伤，破局，死于军中。前则从强，南北皆利；此则木火，西北有害。由此两造观之，局混方之无害也。',
    content: '有食伤泄秀不从强格，丁坐卯和丁坐未火都有损，丁卯有枭神夺食之意，丁未食伤泄秀，运走己巳火同根，木火两旺吉，身旺且伤官见官运走壬申见官大凶且木火皆伤'
  },
  {
    indexString: '0,2,3,3,1,11,9,7',
    narrate: '此方局齐来，得月干丁火独透，发泄菁英，何其妙也。惜乎时干癸水透露，通根亥支，紧伤丁火秀气，谓干头反复，所以一衿尚不能博，贫乏无子。设使癸水换一火土，名利皆遂矣。',
    content: '食伤泄秀但枭神夺食，食伤无力，运走食伤好，遇印通根不吉'
  },
  {
    indexString: '3,3,0,4,0,2,1,11',
    narrate: '此亦方局齐来，干头无水，丁火秀气流行，行运不甚反悖。中乡榜，仕至州牧，子多财旺，赋性仁慈，品行端方，寿越八旬，夫妇齐眉。所谓木主仁，仁者寿，格名曲直仁寿者，信斯言也。由此两造观之，干头反复与全顺得序者，天渊也。',
    content: '曲直仁寿格，食伤无力，运走庚子官杀无力不能冲克继续走曲直仁寿格，一路顺遂'
  },
  {
    indexString: '4,2,0,2,0,4,3,3',
    narrate: '此成方，干透元神，四柱不杂金水，时干丁火吐秀，纯粹可观。初中行运火土，中乡榜，出宰名区；惜木多火炽，丁火不中以泄之，所以运至庚申，不能免祸。',
    content: '从强，丁火泄秀不够，运至官杀凶'
  },
  {
    indexString: '9,3,2,4,0,4,2,2',
    narrate: '此造财旺提纲，丙食生助，当以财星为用，丙火为喜，癸水为忌。身旺用财，遗业十余万初年水木运，一败如灰：至辛亥运，火绝木生，水临旺，冻饿而死。',
    content: ''
  },
  {
    indexString: '7,7,7,3,1,7,3,11',
    narrate: '此乙木归垣，亥卯未全，木势旺盛，金气虚脱，最喜时透丁火，制煞为用。故初运土金之乡，奔驰未遇；至于亥运，生木制煞，军前效力，得县佐；丙戌运中帮丁克辛，升县令。此所谓强众而敌寡，势在去其寡，非煞旺宜制而推也。至酉运，煞逢禄旺，冲破木局不禄。',
    content: '官杀在卯地没有能量，木旺，又食伤制杀，'
  },
  {
    indexString: '7,7,7,3,1,7,4,2',
    narrate: '此乙木归垣，虽无全会，然寅时比亥之力量胜数倍矣。以大象观之，局中三土两金，似乎财生煞旺，不知卯旺提纲，支中皆木之根旺，非金之在地也。初运土金之乡，采芹食廪，家业丰裕：一交丁亥，制煞会局，刑妻克子，破耗异常，犯事革名，忧郁而死。',
    content: '财星透干，身杀两停，运至丁亥食伤制杀凶'
  },
  {
    indexString: '6,2,5,3,1,11,9,7',
    narrate: '此造正合本文成局，干透官星，左右皆空，四柱一无情致，用财则财会劫局，用官则官临绝地，用神无所着落，为人少恒一之志，多迁变之心，以致家业破耗。读书未就，而学医；医又不就，又学堪舆；自以为仲景再世，杨赖复生，而人终不信；又学巫，学易，学命，所学甚多，不能尽述。不但一无所就，而且财散人离，削发为僧矣。',
    content: '用财用官都不行，原局又没有食伤，没有用神，运也都不太行，没有可用的'
  },
  {
    indexString: '8,4,9,7,1,7,9,7',
    narrate: '此造支中三未通根，尚有余气，干透两癸，正三伏生寒，贴身生扶，亦通根身库。官星独发而清，癸水润土养金，生化不悖，财旺生官，中和纯粹。科甲出身，仕至藩臬，官境安和。',
    content: '财生官，官生印，印生身流通局'
  },
  {
    indexString: '5,1,8,8,3,7,2,6',
    narrate: '此造以大势观之，官得清地彼，何彼则富贵，此则困穷 ？不知此造无印，官紧克，午未虽是余气禄旺，丑中蓄水，暗伤午未之火，壬水逢生，又克丙火；更嫌己土一透，不能制水，反能晦火；兼之中运逢土，又泄火气，谓克泄交加。因之功名未遂，耗散资财，尚不免刑妻克子。细究皆己丑两字之患，幸格局顺正，气象不偏，将来运至木水之地，虽然屈抑于前，终必奋亨于后。',
    content: '食伤泄秀，官不旺，食伤克官，财克食伤，又无印流通，丑未相冲，无用神'
  },
  {
    indexString: '9,7,1,3,2,6,7,3',
    narrate: '此官清印正格，喜其未卯拱木，纯粹之象，故为人品超群，才华卓越，文望若高山北斗，品行似良玉精金。异印星太重，官星泄气，神有余而精不足，以致功名蹭蹬，纵有凌去之志，难遂青钱之选，还喜格正局清，财星逢合，虽然大材小用，究竟名利两全，仕路清高。施菁莪之雅化，振古木之人才也。',
    content: '印多，官杀若，运官杀通根，且财生官就好起来了'
  },
  {
    indexString: '7,3,2,8,9,3,8,10',
    narrate: '此印绶格，以申金为用，以丙火为病，以壬水沩药，中和纯粹，秋水通源。运至癸巳，金水逢生得助，科甲联登；壬辰药病相济，由部属出为郡守。盖辛卯庚寅盖头，逢金不能生火环印，名利两全也。',
    content: '天干辛壬癸三七贵人，地支又都是合局不打架'
  },
  {
    indexString: '7,3,2,8,9,3,0,2',
    narrate: '此亦以申金为用，以丙火为病，与前只换一寅字，不但有病无药，而且生助病神。彼则青钱万选，名利两全，此则机杼空抛，守株待兔。更嫌寅申遥冲，卯木助之，印绶反伤，木旺金缺，且月建乃六亲之位，未免分荆破斧，资财耗散。壬运帮身去病，财源稍裕；辛卯庚寅，东方无根之金，功名未能进取，家业不过小康。',
    content: '能力本来比较强，但是走了印运就不如走财运'
  },
  {
    indexString: '5,5,6,6,2,6,0,6',
    narrate: '此造俗论，丙午日支全三年，四柱滴水全无，中年又无水运，必作飞天禄马，名利双辉，不知此造午中己土，巳中庚金，元神透出年月两干，真火土伤官生财格。初交己巳戊辰，汇火生金，遗业颇丰；丁卯丙寅，土金喜用皆伤，连遭回禄三次，又克两妻四子，家业破尽；至乙丑运，北方湿土，晦火生金，又合化有情，经营获利，纳妾生子 ，重振家园；甲子癸亥，北方水地润土养金，发财数万若以飞天合禄论，大忌水运矣。',
    content: '丙寅太烈了'
  },
  {
    indexString: '3,1,9,3,1,3,5,3',
    narrate: '乙卯日，生于卯月卯时，旺之极矣，最喜丁火独发，泄其精英。惜癸水克丁，仍伤秀气，时干己土临绝，不能去其癸水，因之书香不继，初中运逢水木之地刑丧破耗，家业渐消：戊戌丁运，大遂经营之愿，发财巨万，若以飞天禄马论之，则戊戌运大破矣。',
    content: ''
  },
  {
    indexString: '3,7,9,1,0,4,0,10',
    narrate: '此造支全四库逢冲，俗作杂气财官也，不知丑未逢冲，不特官星受伤，而且冲去库根；日主坐下余气，亦是根盘，更嫌戌冲，微根巳气，财多身弱；且旺土愈冲愈旺，则癸水必伤。初运壬子辛水旺之地，荫疪有余；一交庚戌，财煞并旺，椿萱并逝，刑妻克子；己酉戊申土盖天干，使金不能生水，家业破尽，无子而亡。',
    content: '正印比较强，还有比肩帮身，就不喜走把印消耗掉的运，地支丑未冲辰戌冲，财冲各种是非不断，又财多破印，命局不好运也不好'
  },
  {
    indexString: '3,11,9,1,0,0,7,7',
    narrate: '甲子日元，生于丑月，支类北方；天干辛癸，官印元神发露，克去丁火，丑未遥隔；又水势乘权，不能冲丑，正得中和之象。所以土金水运，皆得生化之情，早游泮水，战胜秋闱。只因格局清寒，仕路未居显职，芹泮日长鸣孔铎，杏坛春暖奏虞弦也。前则逢冲，官印两伤，名利无成，此则不动，名成利遂。可知墓库逢冲必发者，谬也。',
    content: '亥子丑三会，让丑未冲不那么强了，癸丑财克印，没有太大成就本本分分做事'
  },
  {
    indexString: '2,2,0,6,2,6,9,5',
    narrate: '此火长夏令，月支坐刃，年支逢生，时支得禄，年月两支，又透甲丙，烈火焚木，旺之极矣，一点癸水熬干，只得从其强势。运逢木火土，财喜频增；申酉运中 ，刑耗多端；至亥运，激火之烈，家业破尽而亡。所谓旺极者，抑之反激而有害也。',
    content: '从强，怕官来克，运走官凶'
  },
  {
    indexString: '4,2,6,8,2,8,2,8',
    narrate: '丙火生于初秋，秋金乘令，二申冲去一寅，丙火之根已拔，比肩亦不能为力。年月两干，又透土金，只得从其弱势，顺财之性，以比肩为病。故运至水旺之地，制去比肩，事业巍峨：丙寅帮身，刑丧破髦。所谓弱极者扶之，徒劳无功，反有害也。此等格局颇多，以俗论之前造必以金水为用，此造必以木为用，以致吉凶颠倒，反归咎于命理之无凭故特书两造为后证云。',
    content: '财旺，还是从强，印被克无用，运再克去比肩即可从强'
  },
  {
    indexString: '9,9,0,0,2,2,4,10',
    narrate: '此造以甲木为精，衰木得水滋，而逢寅禄为精足，以戊土为神，坐戌通根，寅戌拱之为神旺。官生印，印生身，坐下长生为气贯流通，生化五行俱足。左右上下情协不悖，官来能挡，劫来有官，食来有印，东西南北之运，皆可行也，所以一生富贵福寿 ，可谓美矣。',
    content: '财生官，官生印，印生日主，又有食伤泄秀还能制官，流通得很好，运基本都能协调'
  },
  {
    indexString: '9,7,1,3,2,4,6,2',
    narrate: '此造以大势观之，官印相生，偏财时遇，五行不缺，四柱纯粹，俨然贵格，不如财官两字休囚，又遥隔不能相顾，支全寅、卯、辰。春土克尽，不能生金，金临绝地，不能生水，水之气尽泄于木，木之势愈旺而火炽，火炽则气毙，气毙则神枯。行运北方，又伤丙火之气，反助取木之精；即逢金运，所谓过于有余，损之反角其触，以致终身碌碌 ，名利无成出。',
    content: '官星入木，财星坐绝地，财官不能为用，财印打架，整体比较别扭'
  },
  {
    indexString: '4,10,1,1,2,4,5,1',
    narrate: '此四柱皆土，命主元神，泄尽月干，乙木凋枯，所谓精气枯索。运逢壬戌，本主受伤；年逢辛未，紧克乙木，卒于九月患弱症而亡。此造运用逆行，大抵是右命。',
    content: '泄得太过'
  },
  {
    indexString: '0,10,2,2,4,2,2,4',
    narrate: '戊寅日元，生于立春十五日后，正当甲木司令，地支两寅紧克辰戌之土，天干甲木，又制日干之戊，似乎煞旺身弱。然喜无金，则日元之气不泄，更妙无水，则丙火之印不坏，尤羡铁身透丙，化杀生身。由甲傍而悬青绶，从副尹以跻黄堂，名利双收也。',
    content: '身弱，杀印相生，没有财克印，没有水泄土，很好'
  },
  {
    indexString: '0,10,2,2,4,4,6,8',
    narrate: '戊辰日元，生于立春后六日，正戊土司令，月透丙火，生化有情，日支坐辰，通根身旺，又得食神制杀。俗论比之，胜于前造，不知嫩木寒土皆喜火，况杀既化，不宜再制。所嫌者，申时不但日主泄气，而且丙火临绝，以致书香难遂，一生起倒不宁，半世刑丧不免也。',
    content: '格局混乱，本来杀印相生，但又枭神夺食，不知道干什么好，食神又克官杀，很乱'
  },
  {
    indexString: '0,4,3,3,0,0,4,4',
    narrate: '甲子日生卯月，地支两辰，是木之余气也，又辰卯东方，子辰拱水，木太旺者似金也，以丁火为用。至巳运，丁火临旺，名列宫墙；庚辛两运，南方截脚之金，虽有刑耗，而无大患；未运克去子水，食廪天储；午运子水冲克，秋闱失意；壬申运金水齐来，刑妻克子，破耗多端；癸运不禄。',
    content: '日主身强，用食伤泄秀，火为用神，运遇金伤根有所破耗'
  },
  {
    indexString: '9,3,1,3,0,2,1,11',
    narrate: '此造四支皆木，又逢水生，六木两水，别无他气。木旺极者，似火也，出身祖业本丰。惟丑运刑伤，壬子水势乘旺，辛亥金不通根，支逢水旺，此二十年经营，获利数万；一交庚戌，土金并旺，破财而亡。',
    content: '从强格，怕官杀'
  },
  {
    indexString: '1,1,0,8,0,8,7,7',
    narrate: '此造地支土金，木无盘根之处，时干辛金，元神发透，木太衰者，似水也，初运癸未壬午，生木制金，刑丧早见，荫疪难丰；辛巳庚辰，金逢生地，白手发财数万；己卯运土无根，木得地，遭回禄，破财万余；至寅而亡 。',
    content: '从弱了，运把官杀克了就不好了'
  },
  {
    indexString: '5,5,5,5,1,9,2,10',
    narrate: '此造地支皆逢克泄，天干又透火土，全无水气。木衰极者，似土也。初交戊辰丁运，获丰厚之荫疪，美景良多；卯运椿萱并谢；丙运大遂经营之愿，获利万金；寅运克妻破财，又遭回禄；乙丑支全金局，火土两泄，家业耗散；甲子北方水地，不禄宜矣。',
    content: '从弱，运至比劫印帮身则凶'
  },
  {
    indexString: '1,1,8,6,2,10,0,6',
    narrate: '此丙戌日元，月时两刃，壬水无根，又逢木泄。火太旺者，似水也。初运庚辰辛巳，金逢生地，孔怀无辅助之人，亲党少知心之辈；己卯得际遇，戊寅全会火局，及丁丑二十年，发财四五万，至子运而亡。',
    content: '从强了，杀为病，运至杀凶，或从印和食伤角度看也可以杀也是凶'
  },
  {
    indexString: '4,2,3,5,2,2,0,6',
    narrate: '此造丙火生孟夏，地支两坐长生而逢禄旺。火旺极者，似土也。初运虽不逢木，喜其南方火地，遗绪丰盈，读书过目成育；一交庚运，即弃诗书，受嬉好游，挥金如土；申运家破身亡。此造若逢木运，名利两全也。',
    content: '从强，金破坏命局走不到后面'
  },
  {
    indexString: '7,5,3,9,3,9,7,1',
    narrate: '丁火生于八月，秋金秉令，又全金局。火衰者，似木也。初运己未甲午，火木并旺，骨肉如同画饼，六亲亦是浮云；一交癸巳，干透水，支拱金，出外经营，大得际遇；壬辰运中，发财十余万。',
    content: '金旺，月支金又三合金局，有从财的像，助财则顺'
  },
  {
    indexString: '7,11,8,4,2,8,5,11',
    narrate: '此财生杀，杀功身，丙临申，申辰拱水。火衰极者，似金也。初运辛卯庚寅，东方木地，萱椿凋谢，祖业无恒；至己丑运，出外经营，青蚨衬辇，白镪随舆；及戊子二十年，春风吹枊，红绫易公子之裳，杏露沾衣，膏雨沐王孙之袖。所谓有其运，必得其福也。',
    content: '从官杀，再走官杀就很旺'
  },
  {
    indexString: '4,4,4,6,4,8,5,7',
    narrate: '此造重重厚土，生于夏令，土太旺者，似木也，其用在金。庚申运，早采芹香；辛酉运辛丑年，饮鹿鸣，宴琼林，云程直上；壬戌运，刑丧挫折，丙午而亡。',
    content: '用食伤泄秀'
  },
  {
    indexString: '4,10,2,4,5,5,5,5',
    narrate: '此造四柱火土，全无克泄。土旺极者，似金也。初运南方，遗业丰盈，午运入泮，己未棘闱，拔而不举；一交庚申，青蚨化蝶，家业渐消；辛酉财若春后霜雪，事业萧条；壬运克丙不禄。',
    content: '从强，运走食伤有所损益'
  },
  {
    indexString: '8,4,7,11,4,0,9,1',
    narrate: '此造支类北方，水势汪洋，天干又透金水。土太衰者，似火也。运至甲寅乙卯，干支皆木，名成利遂；一交丙运，刑妻克子，破耗多端；至于巳运，岁运火土，暗伤体用，得风疾而亡。',
    content: '从弱，运至印比凶'
  },
  {
    indexString: '9,9,0,0,4,0,8,0',
    narrate: '此四柱皆水，又得金生。土衰极者，似水也。初运癸亥，平宁之境；壬戌水无根，土得地，刑丧破耗，家业消亡；辛酉庚申二十年，大得际遇，白手发财十余万；己未运破去数万，寿亦在未而止。',
    content: '从弱'
  },
  {
    indexString: '8,8,5,9,6,0,6,4',
    narrate: '此造秋金秉令，木火全无。金太旺者，似火也。亥运壬水坐禄，早游泮水，壬子运用神临旺，撞破烟楼，高攀月桂；癸丑合去壬水旺地，囊内青蚨成蝶舞，枝上子规月下啼；甲寅乙卯，尚有制土卫水之功，仁路清高，枫叶未应毡共冷，梅开早觉笔先香。',
    content: '身食两旺，不喜印'
  },
  {
    indexString: '6,8,1,9,6,10,6,4',
    narrate: '此造支类西方，又逢厚土，金旺极者，似水也。初运火，祖业无恒；至戊子运获厚利，纳房出仁已丑庚运，名利皆遂；一交寅运，犯事落职，大破财利；至卯不禄。',
    content: '从强，怕冲'
  },
  {
    indexString: '5,3,6,6,7,3,0,6',
    narrate: '辛金生于促夏，地支皆逢财杀。金太衰者，似土也。初运己巳戊辰，晦火生金，求名多滞，作事少成；一交丁卯，木火并旺，如枯苗得雨，勃然而兴，似鸿毛遇风，飘然而起，家业丰裕交丑生金泄火，不禄。',
    content: '从弱，走财杀'
  },
  {
    indexString: '5,11,3,3,6,2,2,0',
    narrate: '此造木旺乘权，又得水生，四面皆逢财杀。金衰极者，似木也。所以乙丑运中，土金暗旺，家业破尽；至甲子运，北方水旺，财源通裕；癸亥出仁，名利两全壬戌水临绝地， 罢职而归。',
    content: '从弱'
  },
  {
    indexString: '8,2,7,11,8,0,7,1',
    narrate: '此造壬水生于孟冬，支类北方，干皆金水。水太旺者，似土也，喜其寅木吐秀。至甲寅运，早遂青云之志，可谓才藻翩翩，辉映杏坛桃李，文思弈弈，光腾药笼参芩，乙卯运官途顺遂，交丙而亡。',
    content: '有从强的像，运走食伤泄秀可，运走官杀凶'
  },
  {
    indexString: '9,11,9,11,8,0,6,0',
    narrate: '此造四柱皆水，一无克泄，其势冲奔，不可遏也。初运壬戌，支逢土旺，早见刑丧；辛酉庚申，干支皆金，所谓月印午江银作浪 ，门临五福锦铺花；交己未，妻子皆伤，家业破尽；戌午运，贫乏不堪，忧郁而卒。',
    content: '从强，运走已未破格'
  },
  {
    indexString: '2,4,1,7,8,6,9,3',
    narrate: '此火土当权，又逢木助，五行无金。水太衰者，似金也。初交丙申丁酉，盖头是火，使申酉不能生水，财喜并旺；戊戌运中，家业饶裕；己亥土无根，还喜支会木局，虽有破耗而无大患；一交庚子，家破人亡。',
    content: '从弱，运至亥时亥卯未木局影响不大，运至庚子则水有根又金生水凶'
  },
  {
    indexString: '9,3,4,6,8,2,2,6',
    narrate: '此造丙火当权，戊癸从化，枯干壬水。水衰极者，似火也。初运逢火，从其火旺，丰衣足食；乙卯甲寅 ，名利双全；癸丑争官夺财，破耗而亡。',
    content: '从弱，从财，癸丑遇水则凶'
  },
  {
    indexString: '7,5,0,6,9,3,9,11',
    narrate: '癸卯日元，生于亥时，日主之气已贯，喜其无土，才旺自能生官。更妙巳亥遥冲，去火存金，伅星得用，木火受制，体用不伤，中和纯粹。为人智识深沉，器重荆山荆山璞玉，才华卓越，光浮览水珠玑。庚运助辛制甲，自应台曜高躔，朗映紫薇，徽嫌亥卯拱木，木旺金衰，未免嗣息艰难也。此莫宝斋先生造',
    content: '水旺，走金水制火'
  },
  {
    indexString: '5,9,2,0,9,7,4,6',
    narrate: '此王观察造，癸日子月 ，似乎旺相，不知财杀太重，旺中变弱，局中无木，混浊不清，阴内阳外之象。月透财星，其心意必欲爱之；时逢官杀，其心志必欲合之。所以权谋异众，才干过人，出生末微，心术不端。癸酉得逢际遇，由佐二至观察，奢华逢迎，无出其右；至未运不能免祸。所谓欲不除，似蛾扑灯，焚身乃止，如猩嗜洒，鞭血方休',
    content: '财官有些重，运遇比劫帮身吉，又遇财官则凶'
  },
  {
    indexString: '7,9,6,0,2,2,9,5',
    narrate: '此以金为源头，流至寅木，印绶生身更妙。巳时得禄，财又逢生，官星透露，清有精神，中和纯粹，起处亦佳，归局尤美，词林出身，仕至通政，一生无险，名利双辉。',
    content: '流通好，原局好运不损害就好'
  },
  {
    indexString: '7,1,9,5,4,8,2,4',
    narrate: '此以火为源头，流至水方，更妙月时，两火之源，皆得流通，至金水归局，所以富有百万，贵至一品，一生履险如夷，所谓景星庆云，仰众吉之拱向；花攒锦簇，盼五福之絣致。',
    content: '流通比较好，都流通到水上了，地支又合多久不错'
  },
  {
    indexString: '7,3,7,3,2,0,0,6',
    narrate: '此以木为源头，五行无土，不能流至金；财官又隔绝，冲而逢泄，无生化之情。初运庚寅，叼上人之福；己丑运合子，泄火生金财福骈臻；戊子土虚水旺，暗助木神，刑耗端；丁亥克金会木，家破人亡。',
    content: '地支冲克，流通不好，没有食伤来流通起来，运有食伤流通了还好，后面又不流通财官弱，财被官杀消耗官杀被印消耗能量都不足'
  },
  {
    indexString: '6,2,8,6,4,6,3,5',
    narrate: '此以火为源头，年支寅木主节，月干壬水隔之，不能流至金。初运土金之地，冲化阻节之神，业同秋水春花盛，人被尧天舜日恩；一交水春花盛，人被尧天舜日恩；一交丙戌，支会火局，枭神夺食，破耗异常，又克一妻二妾四子；至丁亥运，干支皆合化木，茕茕只影，孤苦不堪，削发为僧。',
    content: '印重，运初可克制印，后火旺土焦则凶，需用财克印'
  },
  {
    indexString: '9,9,0,0,3,3,2,6',
    narrate: '此造天干地支皆杀生印，印生身，时归禄旺，尤妙四冲反为四助，金见水克木而生水，水见木不克火而生木，此自然不隔不占，无阻节之物。日主弱中变旺，运遇水，仍能生木；逢金仍能生水，印绶不伤，所以秋闱早捷，仕至观察。',
    content: '流通起来了，杀印相生一定要身弱，此命造即如此'
  },
  {
    indexString: '4,2,9,11,3,7,7,11',
    narrate: '此癸水临旺，贴峰相克，被戊土合去，反作帮身。月支亥水本助杀，得年支寅亥合来生身，寅本遥隔，反为亲近。时支之亥，又逢未会，以杂为恩。，一来一去，何等情协，一往一会，通关无阻。所以科甲联登，仕至黄堂。',
    content: '杀印相生，还有食伤克杀，运走印比就比较好'
  },
  {
    indexString: '4,4,1,3,7,1,3,9',
    narrate: '此春金气弱 ，时杀紧克，年逢印绶，远隔不通。又被旺木克土坏印，不但戊土不能生化，即日支之丑土，亦被卯木所坏。此局内无可通之理。中运南方杀地，碌碌风霜，奔驰未遇；交庚申克去木神，得奇遇，分发陕西，屡得军功；及辛酉二十年，官至副尹，盖金能克木帮身，印可化杀而通也。',
    content: '原局财克印，印不能帮身化杀，运至庚申辛酉克去财，印就能帮身化杀吉'
  },
  {
    indexString: '5,5,3,3,7,3,1,7',
    narrate: '此春金虚弱，木火当权，年印，月杀，未得相通，时支未土，又会卯化木，只有生杀之情，而无辅主之意，兼之一路运途无金，一派水木，仍滋杀之根源，以致破败祖业。一事无成，至亥运会木生杀而亡。',
    content: '有从弱的势但是没从了，又运遇癸亥把印消耗完了凶'
  },
  {
    indexString: '5,9,2,2,6,8,6,4',
    narrate: '此造以俗论之，春金失令，旺财生杀，杀坐长生，必要扶身抑杀，不知春金虽不当令，地支两逢禄旺，又得辰时印比帮身，弱中变旺，所谓木嫩金坚。若无丙火，则寅木难存；若无寅木，则丙火无根，必要用财滋杀，木火两字，缺一不可也。甲运入泮；子运会水生木，补廪；癸运有己土当头，无咎；亥运合寅，丙火绝处逢生，棘闱奏捷；壬戌支类西方，木火并伤，一阻云程，刑耗并见；辛酉劫刃肆逞，不禄，此造惜运走西北金水，若行东南木火，自然科甲联登，仕路显赫矣。',
    content: '生在寅月，财和杀相互帮扶缺一不可，财杀为用神，运走金财杀无力不禄'
  },
  {
    indexString: '2,8,6,2,6,8,7,5',
    narrate: '此造天干三透庚辛，地支两坐禄旺，丙火虽挂角得禄，无如庚辛元神透露，非火之禄支，是金之长生，用财滋杀明矣。辰运木之余气，采芹生色；巳运火之禄旺，科甲联登；甲午乙未，木火并旺，仕至藩臬。若以八字观之，此造不及前造，只因前造运行西北，此造运走东南。富贵虽定于格局，穷通全在运限，所谓命好不如运好？”，信然也。',
    content: '命格木火相帮能量弱，又庚金相隔，好在运走木火帮扶财杀吉'
  },
  {
    indexString: '4,0,0,2,4,6,0,2',
    narrate: '戊土生寅月寅时，土衰木盛，最喜坐下午火，生拱有情，正谓众杀横行，一仁可化。子水之财，生寅木不冲午火，其情协，其关通。尤羡运走南方火土，所以早登黄甲，出仕驰名。',
    content: '杀重，用印，运走火土吉'
  },
  {
    indexString: '5,11,2,2,4,0,0,2',
    narrate: '此造观格局似胜前造，此财印坐长生，前则印逢财冲。不知前则坐下印绶，七杀皆来生拱，而日主坚固，此则财坐日下，反去生杀，助纣为虐。兼之运走西北，戊午年中乡榜，己丑中进士，此两年比劫帮身，冲去财星之妙也。壬运劫丙坏印；丁运外艰，遭回禄；戌过拱印虽稍有生色，亦是春月秋花。将来辛酉运中，木多金缺，泄土生水，合去丙火，灾祸岂能免耶？',
    content: '印为用，印弱，地支财官一片，运走财官凶'
  },
  {
    indexString: '4,4,6,8,0,0,0,0',
    narrate: '此造木凋金锐，厚土生金，原可畏也，然喜支全水局，化其肃杀之气，生化有情。至癸亥运，科甲连登，早蒙仕路之光；丙寅丁卯，制化皆宜。仕路封疆，官途平坦，生平履险如夷。',
    content: '财生杀，杀生印，印生身流通很好'
  },
  {
    indexString: '4,6,2,4,6,2,2,10',
    narrate: '此造干透两杀，支全杀局，所喜戊土原神透出，是以化杀；寅木本要破甲印，尤喜会火，反培土之根源，巧借栽培，。至己未运中，科甲连登；庚申辛酉，帮身有情，驰名宦海,裕后光前后。',
    content: '杀重用印，运好生印'
  },
  {
    indexString: '9,11,9,11,3,3,9,3',
    narrate: '此造干透三癸，支逢两亥，乘权秉令。喜其无金，两印拱局，生化不悖情而纯粹，辛酉庚申运中，蹭蹬功名，刑耗并见，已未交运，干制杀，支会印，功名层叠而上；接行戊午、丁巳、丙运，仕至观察，名利双辉。',
    content: '印化杀，辛卯庚申财克印凶，后己未运亥卯未木局印强则吉'
  },
  {
    indexString: '4,4,4,6,8,4,0,4',
    narrate: '此造四柱皆杀，喜支坐三辰，通根身库，妙在无金，时透食神制杀。辰乃木之余气，正谓一将当关，群凶自败。至癸亥运，食神逢生，日主得禄，科甲连登；甲运仕县令；子运衰神冲旺，不禄。',
    content: '开始走印运流通，但是食神对印有损耗，行至子运，子午相冲凶'
  },
  {
    indexString: '6,8,6,4,0,10,2,2',
    narrate: '此造甲木生辰，虽有余气，但庚金并透，通根斫伐，最喜寅时禄旺，更妙丙火独透，制杀扶身。午运暗会火局，中乡榜；甲申乙酉杀逢禄旺，刑耗多端；直至丙戌运，选知县。',
    content: '运中食神制杀'
  },
  {
    indexString: '8,0,8,0,2,10,4,10',
    narrate: '此造年月两逢壬子，杀势猖狂。喜而日时坐戌，通根身库，更妙戊土透出，足以砥定汪洋，尤羡运走东南，扶身抑杀。至乙卯运中，水临绝，火逢生，鹿鸣宴罢琼林宴，桂花香过杏花香，仕至郡守。',
    content: '原局食神制杀，势均力敌，运又流通'
  },
  {
    indexString: '8,8,2,6,6,6,2,10',
    narrate: '此造两杀当权临旺，原可畏也。喜赖年干壬水临申，足以制杀；更妙无木，则水不泄，火无助。申运金水得助，发轫宫墙；酉运支类西方，早充观国之光，高豫南宫之选；后运金水，体用皆宜，由署郎出为郡守。',
    content: '原局流通还行，也没有财来克制印和食神，即可'
  },
  {
    indexString: '9,1,4,6,2,6,8,4',
    narrate: '此造火长夏天，旺之极矣。戊癸合而化为忌，还喜壬水通根身库；更妙年支坐丑，足以晦火养金而蓄水，则癸水仍得根，虽合而不化也。不化反喜其合，则不抗呼壬水矣。是以乙卯甲寅运，克土卫水，云程直上；至癸丑运，由琴堂而迁州牧；及壬子运，由治中而履黄堂，名利裕如也。',
    content: '走木水运好，身强把杀扶起来就有作为'
  },
  {
    indexString: '9,5,4,6,2,6,8,4',
    narrate: '此铁樵自造（乾隆三十八年四月十八日辰时），亦长夏天，与前造只换一丑字，天渊之隔矣。夫丑乃北方之湿土，能晦丙火之烈，能收午火之焰，又能蓄水藏金。巳乃南方之火火，癸临绝地，杯水舆薪，喜其混也。不喜其清也。彼则戊癸合而不化，此则戊癸合而必化，不但不能助杀，抑且化火为劫，反助阳刃猖狂。巳中庚金，无从引助，壬水虽通根身库，总之无金滋助，清枯之象，兼之运走四十载木火，生助劫刃之地，所以上不能继父志以成名，下不能守田园而创业，骨肉六亲，直同画饼，半生事业，亦似浮云。至卯运，壬水绝地，阳刃逢生，遭骨肉之变，以致倾家荡产。犹忆未学命时，请人推算，一味虚褒，以为名利自如，后竟一毫不验。岂不痛哉！且予赋性偏拙，喜诚实不喜虚浮，无谄态，多傲慢，交游往来，每落落难合，所凛凛者，吾祖吾父，忠厚之训，不敢失坠耳。先严逝后，家业凋零，潜心学命，为糊口之计。夫六尺之躯，非无远图之志，徒以末技见哂，自思命运不济，无益于事，所以涸辙之鲋，仅邀升斗之水。限于地，困于时，嗟乎！莫非命也！顺受其正云尔！',
    content: '卯运杀废了凶'
  },
  {
    indexString: '4,8,9,11,2,6,8,4',
    narrate: '此造日主虽坐旺刃，生于亥月，究竟休囚；五行无木，壬癸并透，支逢生旺，各立门户。喜其合去癸水，不致混也；更妙运走东南木火，乡榜出身，宠赐传来紫闼，承宣协佐黄堂。',
    content: '运走木火吉'
  },
  {
    indexString: '4,6,9,11,2,10,8,4',
    narrate: '丙戌日元，生于辰时，冲去库根，壬癸并透。喜其戊合，去官留杀；更喜年逢刃助，火虚有焰；更妙无金，稍胜前造。科甲出身，宿映台垣，重藉旬宣之职，猷分禹服，特隆锁钥之权。',
    content: '运走木火吉，食伤克官'
  },
  {
    indexString: '8,8,3,7,3,7,9,3',
    narrate: '此造日月皆丁未，时杀无根，喜其壬水官星助杀，不宜合也。幸而壬水坐申，合而不化，申金为用，更妙运走西北金水，助起官杀，乡榜出身，仕榜连登，由县令而迁司马，位跻黄堂。',
    content: '身旺，财为用助官，运走财官'
  },
  {
    indexString: '0,4,5,5,4,4,1,3',
    narrate: '戊土生于巳月，日主未尝不旺，然地支两辰，木之余气亦足。喜其合杀留官，官星坐禄，更妙运途生化不悖。所以早登云路，掌典籍而知制诰，陪待从而应传宣也。',
    content: '运走财生官，把官扶起来了'
  },
  {
    indexString: '2,4,7,3,6,8,3,1',
    narrate: '此造春金虽不当令，喜其坐禄逢印，弱中变旺；丙辛一合，丁火独清，不但去杀，而且去劫，财无劫夺，官有生扶。尤妙运走东南木火，所以早遂表钱之选，兆人镜之芙蓉，作春官之桃李也。',
    content: '运走财官吉'
  },
  {
    indexString: '2,4,7,3,1,11,6,4',
    narrate: '乙亥日元，坐下逢生，又月令建禄归垣，足以用财。喜丙辛金弱，而去乙庚，木旺不从。乡榜出身，至丙申丁酉，火盖天干，未能显秩；究竟方金地，亦足以琴堂解愠，花院征歌也。',
    content: ''
  },
  {
    indexString: '9,11,4,6,8,6,5,9',
    narrate: '此造旺杀逢财，喜其合也。妙在癸水临旺，合而不化，则有情戊土，不抗壬水也。合而化，则无情化火，仍生土也。由此以推，运走东方木地，早遂青云之志；运走北方水地，去财护印，翔步天衢，置身日舍也。',
    content: '运走食伤克官，但食伤生财财生官还是不太好，运走印克财制住财就好很多'
  },
  {
    indexString: '8,4,8,0,2,2,9,5',
    narrate: '此造壬癸当权，杀官重叠，最喜日坐长生，寅能纳水，化杀生身，时归禄旺，足以敌官；更妙无金，印星得用，煞势虽强，不足畏也。至丙运帮身，又逢己巳流年，去官之混，捷报南宫，出宰名区。',
    content: '印为用，且无财吉'
  },
  {
    indexString: '0,0,1,11,5,5,3,3',
    narrate: '此造官遇长生，杀逢禄旺，巳亥虽冲破印，喜印木仍能生火，寅运合亥，化木生印，连登甲榜。庚辰辛巳制官服煞，失幡皂盖，出守大郡，名利两优。',
    content: '流通好，官杀混杂去杀留官'
  },
  {
    indexString: '2,4,3,9,6,6,4,2',
    narrate: '此造杀逢生，官得禄，喜其秋金秉令，更妙辰土泄火生金，不失中和之象；尤喜运走北方水地。庚子运冲去官根，鹿鸣方宴饮，雁塔又题名；辛丑壬寅运，横琴而歌解愠，游刃而赋烹鲜。',
    content: '官杀旺向，身又强，制住官杀即得官杀'
  },
  {
    indexString: '4,6,5,7,8,8,7,11',
    narrate: '此造官杀并旺当令，喜日坐长生，时逢禄旺，足以敌官挡杀。坐下印绶 ，引通财杀之气，运走西北金水之乡。所以少年科甲，裕经纶于管库，人推黼黻之工，乘抚宇于催科，世让文章之焕。',
    content: '官印相生吉'
  },
  {
    indexString: '7,3,4,10,2,4,5,11',
    narrate: '时逢独杀，四食相制，年支卯木被辛金盖头，况秋木本不足疏土，所赖亥中甲木卫杀，至乙未运暗会木局，捷报南宫，名高翰苑：甲午运木死于午，合已化土，丁外艰：已巳年又冲去亥水，不禄。',
    content: '食伤过旺，财被印克无力，杀无力'
  },
  {
    indexString: '7,3,4,10,2,4,8,4',
    narrate: '此亦一杀逢四制，所不及前造者，无亥卯之会也。虽早采芹香，以致蹭蹬秋闱纳捐瞩，仁路亦不能通达。喜时杀透露，行甲午运，无化土之患，然犹刑耗多端，而己身无咎。',
    content: ''
  },
  {
    indexString: '8,4,2,6,2,6,8,4',
    narrate: '此杀逢四制，柱中印虽不见，喜其杀透食藏， 通根身库。总之夏火当权，水无金滋。至酉运，合去辰土，财星滋杀，发甲点中书；庚运仁版连登，入参军机；戌运，燥土冲动壬水之根，又逢戊土透出，紧制壬水，不禄。',
    content: '运走财助官，运走食伤杀无用凶'
  },
  {
    indexString: '0,2,4,4,8,4,8,2',
    narrate: '此造五杀逢五制，土虽当权，木亦雄壮，幸日主两坐库根，又得比肩匡扶。壬申运，日主逢生，冲去寅木，名登桂籍，雁塔高标；接连癸酉二十年，由县令履黄堂。名利裕如。',
    content: '运至印流通起来，克食伤助杀'
  },
  {
    indexString: '6,8,4,2,4,2,6,8',
    narrate: '此两杀逢四制，幸春木得时乘令，克不尽绝。至午运，补土之不足，去金之有余，登科擢县令：至甲申支，又逢食制，死于军功。',
    content: '甲申把杀冲克凶'
  },
  {
    indexString: '5,1,7,7,2,2,5,1',
    narrate: '火土伤官重叠，幸在季夏，火气有余，又日坐长生，寅中甲木为用。至丁卯运，克去辛金，破其丑土，所谓有病得药，腾身而登月殿，庆集琼林；接运丙寅，体用皆宜，仕至黄堂。',
    content: '伤官旺，财克印，运至印比助身克财吉，生在未月助身'
  },
  {
    indexString: '7,9,3,9,4,6,7,9',
    narrate: '此土金伤官重叠，喜其四柱无财，纯清气象。初运木火体用皆宜，所以壮岁首登龙虎榜，少年身到凤凰池。惜中运癸巳壬辰，金生火克，所以生平志节从何诉，半世勤劳只自怜。',
    content: '食伤旺，有印帮身，运走财克印凶'
  },
  {
    indexString: '8,10,8,0,6,4,5,3',
    narrate: '此金水伤官当令，喜支藏暖土，足以砥定中流。因时财为病，兼之初运水木，以致书香不继；至三旬外，运逢火土，异路出身，仕至州牧；午运衰神冲旺，台省几时无谪宦，郊亭今日倍离愁。',
    content: '食伤旺，印被财克，运至官印助身吉'
  },
  {
    indexString: '2,4,9,5,1,1,2,0',
    narrate: '此木火伤官，印绶通奶禄支，格局未尝不美。虽嫌财星坏屯，而丑辰皆湿土，能蓄水晦火。惜乎运途无水，以致一介寒儒，至申运火绝水生，名列泮宫，后九赴秋闱不捷。',
    content: '食伤旺，财克印，又运无印凶'
  },
  {
    indexString: '2,8,4,10,3,3,1,5',
    narrate: '此火土伤官，劫印重叠，旺可知矣，以申金财星为用。遗业本丰，辛丑壬运，经营获利，发财十余万；至寅运，金临绝地，劫遇长生 ，又寅申冲破，所谓“旺者冲衰衰者拔”，不禄宜矣。',
    content: '财为用神，运后期财克没了凶'
  },
  {
    indexString: '9,11,1,3,8,8,1,5',
    narrate: '此水木伤官，日主坐长生，年支禄旺，日主不弱 ，足以用巳火之财。嫌其中运金水，半生碌碌风霜，起倒万状。至戊运，紧制亥水之劫，合起卯木化财，骤然发财数万；至酉冲破伤官，生助劫印，不禄。',
    content: '财为用'
  },
  {
    indexString: '4,0,7,9,4,6,3,5',
    narrate: '此土金伤官，日主禄旺，劫印重逢，一点财星，秋水通源。子赖酉生，酉伏子护，遗业小康；甲子乙丑二十年，制化皆宜，自创数万；至丙寅运，生助火土，克泄金水，不禄。',
    content: '财为用'
  },
  {
    indexString: '8,8,7,11,7,9,6,2',
    narrate: '此金水伤官，四柱比劫，虽用寅木之财，却喜亥水，泄金生木，使比劫无争夺之风，又得亥解申冲。若无亥水，一生起倒无宁，终成画饼。亥水者，生财之福神也。交甲寅乙卯，白手成家致富；后行火运，战克不静，财星泄气，无甚生色；至巳运，四孟冲，劫又逢生，不禄。',
    content: '财为用'
  },
  {
    indexString: '9,11,7,9,4,8,5,7',
    narrate: '此土金伤官，财星太重，以致拂意芸窗。幸喜未时，劫财通根为用；更妙运途却佳，捐县佐出仕。至丁巳丙辰运，旺印用事，仕至州牧，宦资丰厚；乙卯冲克不静，罢职归田。',
    content: '印比为用，财重比劫克财'
  },
  {
    indexString: '5,7,9,9,4,10,6,8',
    narrate: '此土金伤官，支类西方，金气太重，以劫为用。喜其当头克癸，故书香继志 ；更妙运走南方火地，拔贡出身，由县令而迁州牧，荐莅黄堂。一生逢凶化吉，宦海无波也。',
    content: '食伤重，比劫为用克财和食伤'
  },
  {
    indexString: '4,8,5,7,2,10,5,1',
    narrate: '此四柱伤官，若生丑戌月，为从儿格，甸利皆遂。生于未月，火有余气，必以未中丁火为用。惜运走西北金水之地，以致破败祖业；至癸亥运，贫乏无聊，削发为僧。',
    content: '比劫为用，月令不能从儿格'
  },
  {
    indexString: '4,4,6,8,5,9,9,9',
    narrate: '此亦伤官用劫，嫌其辰为湿土，生金拱水，未足帮身；更嫌运走西北金水之地，以致一败如灰，不成家室。',
    content: ''
  },
  {
    indexString: '6,4,5,3,8,4,6,0',
    narrate: '壬水生于卯月，正水木伤官格。天干己土临绝，地支两辰，乃木之余气，一生金，一拱水，又透两庚，不但辰土不能制水，反生金助水，必以卯木为用，所谓一神得用，此象匪轻。初运庚辰辛巳，金之旺地，功名不遂；至壬午运，生财制金，名题雁塔；癸未生拱木神，甲申支全北方水局 ，木逢生助，仕版连登，由令尹而升司马，荐至黄堂，擢观察而履臬藩，入座封疆；一交酉，冲破卯木，诖误落职。所谓用神不可损伤，信斯言也。',
    content: '印比旺，用食伤'
  },
  {
    indexString: '1,9,4,2,9,9,9,1',
    narrate: '癸水生于寅月，正水木伤官。地支印星并旺，酉丑拱金，必以寅木为用，才能有余。乙亥运，木逢生旺，中乡榜；甲戌癸运，出仕县令；酉运支逢三酉，木嫩金多，诖误落职。前造与此造皆因少火，有病无药之故，若有火虽行金地，则无大患矣。',
    content: '印比旺，食伤为用'
  },
  {
    indexString: '5,3,6,6,0,2,3,3',
    narrate: '甲木生于午月，木火伤官。年月两干，土金无根，置之不用；地支两卯一寅，日元强，必以丁火为用，故人权谋异众。丁卯运，入泮登科，仕县令；丙寅运，克尽庚金，宦资大丰；乙丑合庚，晦火生金，落职。',
    content: '财杀无根不为用，比劫旺食伤泄秀为用'
  },
  {
    indexString: '2,0,1,7,2,4,1,7',
    narrate: '丙日未月，火土伤官。四柱无金，子水枯干，未土为用。第嫌乙木并透根深，功名难遂。初运丁酉丙申，制化乙木，财喜称心；戊戌十年，熙熙攘攘，日炽日昌；己运土无根，木回克，刑耗并见；一交亥运，木得生火，逢劫，得恶病而亡。',
    content: '伤官配印，印比旺伤官为用'
  },
  {
    indexString: '8,10,5,9,4,10,1,3',
    narrate: '戊日酉月，土金伤官，地支两戌，燥而且厚，妙在年干壬水，润土泄金而生木，足以用官。亥运，财官皆得生扶，功名顺遂；壬子，早遂仕路之志；癸丑，支拱金局，服制重重；甲寅乙卯二十年，仕至侍郎。',
    content: '有财星通关'
  },
  {
    indexString: '6,6,5,3,8,8,5,9',
    narrate: '壬水生于卯月，水木伤官。喜其官印通根，年支逢财，伤官有制有化，日元生旺，足以用官。巳运 ，官星临旺，采泮水之芹，折蟾宫之桂；壬午癸未，南方火地，出宰名区，莺迁州牧；甲申乙酉金得地，木临绝，虽退归，而安享琴书，其乐自如也。',
    content: '官印相生，把食伤克掉为用'
  },
  {
    indexString: '7,7,7,3,8,4,5,9',
    narrate: '壬水生于卯月，水木伤官，天干两辛，支逢辰酉，益水之源，官之根固，伤之荫泄，必以己土官星为用。己丑运，采芹食廪；戊子虽然蹭蹬秋闱，而家业日增；丁运亦无大患；至亥运会木局，伤官肆逞。刑耗并见而亡。',
    content: '官印相生，食伤多余克掉为用'
  },
  {
    indexString: '9,9,5,7,2,6,9,5',
    narrate: '丙午日元，支类南方，未土秉令，己土透出，火土伤官，藏财受劫，无官则财无存，无财则官亦无根；况火焰土燥，官星并透，以官为用。运至火土，破耗刑丧；乙卯甲寅运，虽能生火，究竟制伤卫官，大获财利，纳粟出仕；癸丑壬子运，由佐贰而升县令，名利两全。',
    content: '伤官见官，把食伤克掉，有财生官，官星能量弱，把官星助起吉'
  },
  {
    indexString: '4,8,4,6,3,5,1,5',
    narrate: '此火土伤官，日主旺极，喜其伤官发泄菁华，更妙财星得用。庚申辛酉运，少年创业，发财十余万；壬戌幸而水不通根 ，虽有刑耗而无大患；至癸亥运，激火之烈，泄财之气，不禄。',
    content: '食伤泄秀生财，流通好，不喜见官'
  },
  {
    indexString: '8,0,7,11,8,0,9,3',
    narrate: '六水乘权，其势泛溢，全赖卯木泄其精英。初交水运 ，仍得生助木神，平宁无咎；甲寅乙卯，正得用神之宜，采芹食禀，丁财并益；一交丙辰，群比争财，三子克二，夫妇皆亡。',
    content: '印比旺，用食伤泄秀'
  },
  {
    indexString: '8,4,8,0,8,0,9,3',
    narrate: '此天干皆水，支逢旺刃，喜其支合卯辰，精英吐秀，所以书香早遂。但木之原神不透，未免蹭蹬秋闱；更嫌运逢火地，犹恐寿元不永。交丙运庚午年，水火交战而亡。',
    content: '食伤泄秀'
  },
  {
    indexString: '4,6,2,4,4,4,7,9',
    narrate: '此重重火土，最喜酉时，伤官透露，泄其菁华。三旬之前，运走火土，蹭蹬芸窗，一交庚申，云程直上。及辛酉壬戌癸亥四十载，体用合宜，由署郎出为巡使，从藩臬而转封疆，宦海无波。',
    content: '印比旺用食伤泄秀，食伤透干吉'
  },
  {
    indexString: '1,9,7,5,4,6,2,4',
    narrate: '此火土当权，乙木无根，以辛金为用。辛丑年入泮，后因运程不合，屡困秋闱。至丑运暗拱金局，科甲连登；丙子乙亥，地支之水，本可去火，天干木火不合，所以仕途蹭蹬，未能显秩耳。',
    content: '伤官见官，官星无力，食伤为用'
  },
  {
    indexString: '3,9,1,5,4,6,2,4',
    narrate: '此与前造只换一辛字，八字不及前造，而运途却胜于前，亦以辛金为用，非官印论也。丁丑年湿土生金晦火，又全会金局，发甲入词林，盖运在辛丑，正岁运皆宜也。',
    content: '食伤为用，运把官星克金，伤官配印吉'
  },
  {
    indexString: '3,1,2,6,5,9,7,7',
    narrate: '此造土荣夏令，金绝火生，四柱水木全无，最喜金透通根。惜乎运走东方，生火克金，不但功名增蹬，而且财源鲜聚。交辛丑运，年逢戊辰，晦火生金，食神喜劫地，秋闱得意，名利裕如。',
    content: '食伤为用'
  },
  {
    indexString: '9,9,0,0,2,2,1,7',
    narrate: '丙生子月，坐下长生，印透根深，弱中之旺。喜其官星当令，透而生财，所谓“一清到底有精神”也；更妙源流不悖，纯粹可观。金水运中，登科发甲。名高翰苑；惜中运火土，以致终老于词林。',
    content: '流通很好，但印有点旺，财官为用'
  },
  {
    indexString: '0,0,2,2,5,11,7,11',
    narrate: '春土坐亥 财官太旺，最喜独印逢生。财藏生官，财印绶之元神愈旺；气贯生时 ，而日主之气不薄；更妙连珠生化，尤羡运途不悖。所以恩分雕绵，宠锡金莲，地近清楚，职居津要。',
    content: '官旺，喜印比，运印通根吉'
  },
  {
    indexString: '9,7,0,0,2,2,3,9',
    narrate: '此与前癸酉者，大同小异。前则官坐财地，此则官坐伤地，兼之子未相贴，不但天干之官受克，即地支之官亦伤。更嫌劫入财乡，所谓财劫官伤，纵使芹香早采，仍蹭蹬秋闱。辛酉庚申运干支皆财，财如放稍春竹，利如蔓草生枝，家业丰裕；一交己未，伤妻克子，遭回禄，家业大破。可知穷通在运也 。',
    content: '财官为用，官临伤官，好在月令当时且官星通根，伤官作用不大，但财被印阻隔，力量不强，只能靠运来支持'
  },
  {
    indexString: '1,11,6,4,4,10,3,5',
    narrate: '戊戌日元，生于辰月巳时，木退气，土乘权，印绶重逢。用官则被庚金合坏，用食则官又不从化，而火又克金，无奈何而用财，又有巳时遥冲，又不当令；若邀庚金生助，贪合忘生，且遥隔无情，所以起倒不一，幸而财官尚有余气，至乙亥运，补起财官，遂成小康。',
    content: '印比重，地支冲克一片，食伤财官都弱，运扶财官时能好一点'
  },
  {
    indexString: '9,11,5,7,2,6,5,1',
    narrate: '火长夏令，原属旺论，然时在季夏，火气稍退，兼之重叠伤官泄气，丑乃湿土，能晦丙火之光，以旺变弱。浊气当权 ，清气失势，兼之先行三十年火土运，半生起倒多端。至乙卯甲寅，木蔬厚土，扫除浊气，生扶日元，卫护官星，左图右史，财茂业成。',
    content: '食伤重，且伤官见官，不流通有浊气，喜印比，运至印吉'
  },
  {
    indexString: '3,3,3,7,6,6,5,3',
    narrate: '此造大略观之，财生官，官生印，印生身，似乎清美，无如午未南方，火烈土焦，能脆金，不能生金；且木从火势，又坏印绶，无生化之情，非清枯而何？更嫌运走东方，一生未遂，所谓“明月清风谁与共，高山流水少知音”也。',
    content: '看似流通，财官印，但是印无力，卯未半三合木，印无力了，喜印为用'
  },
  {
    indexString: '0,0,2,2,5,1,0,0',
    narrate: '财官旺，印比为用',
    content: ''
  },
  {
    indexString: '8,8,8,2,2,0,1,7',
    narrate: '铁制军造，杀逞财势，嫩木逢生，最喜寅木真神当令，时干透出乙木元神。寅申之冲，谓之有病。运至南方火地，去申金之病，仕至封疆，声名赫弈。有润泽生民之德，怀任重致远之才也。',
    content: '杀重用印比，喜印为月令透干能把财克掉阻止其继续生杀'
  },
  {
    indexString: '6,8,4,2,8,0,0,4',
    narrate: '此造日临旺地，会局帮身，不当弱论。喜其时干甲木，真神发露；所嫌者，年遇庚申，冲克甲寅，又逢戊土之助，谓假乱真。虽然早采芹香，屡困秋闱；至壬午运，制化庚金，秋桂高攀，加捐县令；申运冲寅，假神得助，不禄。',
    content: '申子辰水局，身旺，食伤为用，又枭神夺食，印为假神克掉为妙'
  },
  {
    indexString: '1,9,4,2,8,6,6,10',
    narrate: '杀重又有食伤泄秀，财又生杀，喜印比，运走印比吉',
    content: ''
  },
  {
    indexString: '6,10,4,2,9,7,9,1',
    narrate: '癸水生于立春二十六日，正当甲木真神司令，而天干土金并透，地支丑戌通根。伤官虽当令，而官杀之势纵横，即使伤敌杀，而日主反泄，况未能敌乎？庚金虽是假神，无如日主爱假憎真，用以庚金，有两歧之妙：一则化杀官之强暴，二则生我之日元，时干比肩帮身，又能润土养金。第中运南方，生杀坏印，奔驰不遇；至甲申，运转西方，用神得地，得军功飞升知县：乙酉更佳，仁至州牧：一交丙，坏庚，不禄。',
    content: '杀重用印比，忌财坏印生官'
  },
  {
    indexString: '2,0,5,11,7,9,5,11',
    narrate: '此造以俗论之，寒金喜火，金水伤官喜见官，且日主专禄，必用丙火无疑。不知水势猖狂，病窃去命主无元神，不但不能官，即或用官，而丙火全无根气，必须用己土之印，使其止水生金卫火。丙入亥宫临绝，欲使丙火生土，而丙火先受水克，焉能生土？所以己土反被水伤，真神无情，假神虚脱。初运庚子辛丑。比劫帮身，叨荫之福，衣食颇丰：壬运丁艰；一交寅运，东方木地，虚土受伤，破荡祖业，刑妻克子，出外不知所终。',
    content: '食伤旺，印比为用，忌财生官坏印'
  },
  {
    indexString: '8,8,4,8,6,4,0,8',
    narrate: '庚金生于七月，地支三申，旺之极矣，时干甲木无根，用年干壬水，泄其刚杀之气。所嫌者，月干枭神夺食。初年运走土金，刑丧早见，祖业无恒；一交辛亥，运转北方，经营得意，及壬子癸丑三十年财发十余万。其幼年未尝读书，后竟知文墨，此亦运行水地，发泄菁华之意也。',
    content: '印比太重，财无力，食伤为用'
  },
  {
    indexString: '8,10,4,8,6,2,2,10',
    narrate: '庚金生于七月，支类土金，旺之极矣，壬水坐戌逢戊，枭神夺尽，时透丙火，支拱寅戌，必以丙火为用。惜运走四十载土金水地，所以五旬之前，一事无成：至甲寅运克制枭神，生起丙火，及乙卯二十年，财发巨万，所谓蒲柳望秋而凋，松柏经冬而茂也。',
    content: '印比旺，枭神夺食，食伤为病，用食伤泄秀反而会激起矛盾，枭神夺食和食伤克官杀，实则财为用，食伤生财，财生官克印'
  },
  {
    indexString: '7,9,3,9,1,7,3,1',
    narrate: '乙木生于八月，木凋金锐，幸日主坐下库根，干透两丁，足以盘根制杀，祖业丰盈，芹香早采。但此造之病，不在杀旺，实在丑土；丑土之害，不特生金晦火，其害在丑未之冲也。天干木火，全赖未中一点微根，冲则被丑中金水暗伤，以致秋闱难捷。至癸巳运，全无金局，癸水克丁，遭水厄而亡。',
    content: '财官旺，丑未冲，运至巳，巳酉丑三合金局，杀旺凶'
  },
  {
    indexString: '4,4,5,9,1,11,0,8',
    narrate: '乙木生于八月，财生官杀，弱之极矣。所喜者，坐下印绶引通官杀之气，更妙甲木透出，谓藤萝系甲。出身虽寒微，至亥运入泮，壬子联登甲第，及壬癸运，早遂仕路之光；丑运丁艰，甲寅克土扶身，不次升迁；乙卯仕至侍郎。此造之所喜者，亥水也，若无亥水，不过庸人耳。然亥水必要坐下，如在别支，不得生化之情，功名不过小就耳。',
    content: '财官虽旺，喜在日主坐印且运走印比吉'
  },
  {
    indexString: '6,4,6,4,6,8,6,4',
    narrate: '天干皆庚，又坐禄旺，印星当令，刚之极矣，谓权在一人。行伍出身，壬午癸未运，水盖天干地支之火，难以克金，故无害；一交甲申，西方金地及乙酉合化皆金，仕至总兵；丙运犯其旺神，死于军中。',
    content: '从强，怕官来克'
  },
  {
    indexString: '9,9,0,0,6,4,0,8',
    narrate: '庚辰日元，支逢禄旺，水本当权，又会水局，天干枯木无根，置之不论，谓金水二人同心，必须顺其金水之性。故癸亥壬运，荫庇有余；戌运制水，还喜申、酉、戌全，虽见刑丧地而无大患，辛运入泮，酉运补廪，庚运登科，申运大旺财源；一交已未，运转南方，刑妻克子，家业渐消。戊午触水之性，家业破尽而亡。',
    content: '金水木流通，忌印'
  },
  {
    indexString: '8,0,7,11,1,11,2,0',
    narrate: '壬水乘权坐亥子，所谓昆仑之水，冲奔无情，丙火克绝，置之不论，遗业颇丰，乙卯甲寅，顺其流，纳其气，入学补廪，丁财并益，家道日隆。一交丙运，水火交战，刑妻克子，破耗异常；辰运蓄水无咎；丁巳运连遭回禄两次，家破身亡。',
    content: '水极旺，食伤被克完，从强，忌火来克水'
  },
  {
    indexString: '0,8,2,0,6,4,4,2',
    narrate: '此寒金冷水，木凋土寒，若非寅时，则年月木火无根，不能作用矣，所谓寒虽甚，要暖有气也。由引论之，年得者寅也，地气上稓，木火绝处逢生，一阳解冻。然不动丙火高亦不发，妙在寅中遥中，谓之动，动则生火矣。凡四柱紧冲为克，遥冲为动，更喜运走东南，科甲出身，仕至黄堂，所谓“得气之寒，遇暖而发”，此之谓也。',
    content: '原局金水重，喜木火即财官'
  },
  {
    indexString: '5,9,2,0,6,4,0,8',
    narrate: '此亦寒金冷水，土冻木凋，与前大同小异，前则有寅木，火有根，此则无寅木，火临绝，所谓寒甚而瞹无气，反以瞹为美，所以初运乙亥，北主水地，有喜无忧；甲戌暗藏丁火，为丙火之根，刑丧破耗；壬运克去丙火，入申运食廪，癸酉财业日增，辛未运转南方，丙火得地生根，破耗多端；庚午运逢寅年，木火齐来，不禄。',
    content: '申子辰水局，原局走食伤泄秀，所以财官为浊气，克掉为妙，运走财官反凶'
  },
  {
    indexString: '3,1,2,6,2,6,8,4',
    narrate: '此火焰南离，重逢刽刃，暖之至矣。一点壬水，本不足以制猛烈之火，喜其坐辰，通根身库；更可爱者，年支丑土，丑乃北方湿土，能生金晦火而蓄水，所谓暖虽至而寒有根也。科甲出身，仕至封疆，微嫌运途欠畅，多于起伏也。',
    content: '喜食伤泄秀，官杀有根运遇也无大碍'
  },
  {
    indexString: '9,7,3,5,2,6,9,5',
    narrate: '此支类南方,又生巳时，暖之至矣。天干丙癸，地支全无根气，所谓暖之至，寒无根，反以无寒为美。所以初运丙辰，叨荫庇之福；乙卯甲寅，泄水生火，家业增新；癸丑寒气通根，叹椿萱之并逝，嗟壮桂之摧残；壬子运，祝融之变，家破而亡。',
    content: '比劫旺，顺其性暖，则不喜官杀寒克去为妙，且伤官见官，比劫旺有伤官走伤官泄秀吉'
  },
  {
    indexString: '2,4,7,1,6,4,2,0',
    narrate: '此造以俗论之，以为寒金喜火，干透两丙，独杀留清，推其木火运中，，名利双全，少右支中重重湿土，年干丙火，合辛化水，时干丙火无根，只有寒湿之气，并无生发之意，中得用水，不能用火矣。所以初运壬寅癸卯，制土卫水，衣食颇丰；天地丙午丁未二十年，妻子皆伤，家业破尽。削发为僧。',
    content: '整体湿寒，用食伤泄秀，不用官印相生，所以克去官杀为妙，因为官杀和食伤冲突'
  },
  {
    indexString: '3,7,8,0,6,10,2,10',
    narrate: '此造如以水势论之，此则仲冬水旺，所喜者支中重重燥土，足以去其湿气。只为相克，使子不能助壬；丁壬一合，使壬不能克丙。中运土金，入部办事，运筹挫折，境遇违心；丁未南方火旺，议叙出仕，至丙午二十年，得奇遇，仕至州牧。',
    content: '湿气过大用火，走杀印相生，把食伤克去为妙'
  },
  {
    indexString: '9,7,3,5,0,6,6,6',
    narrate: '甲午日元，支全巳午未，燥烈极矣。天干金水无根，反激火之烈，只可顺火之气也。初运木火，顺其气势，财喜频增，至癸丑，叹刑丧，遭挫折，破耗多端；壬子冲激更甚，犯人命，遭回禄，破家而亡。',
    content: '食伤过旺，过燥，不能直接用印水来压制，应顺其势用木，也就用比劫来化食伤'
  },
  {
    indexString: '9,1,3,5,0,4,6,6',
    narrate: '此与前造只换辰丑二字，丑乃北方湿土，晦火蓄水，癸水通根而载丑；辰亦湿土，又是木之余气，日元足盘根；庚金虽不能生水辅用，而癸水坐下余气，竟可作用。初运木旺，帮身护用，和平迪吉；至癸丑北方水地及壬子辛亥三十年，经营得意，事业称心。',
    content: '有点燥用水吉，食伤生财，财生官，官生印，所以印比为用'
  },
  {
    indexString: '5,3,7,7,2,0,7,3',
    narrate: '丙火生于未月，火气正盛，坐下官星，被未土伤尽，只得用天干辛金。所嫌者，未为燥土，不能生金，又暗藏劫刃；年干己土，本可生金，又坐下印地，所谓“吉神显露，凶物深藏”者也。初运己巳戊辰土旺之地，财喜辐辏，事事称心；交丁卯，土金两伤，连遭回禄三次，又伤丁七人，丙寅妻子皆克，出外不知所终。',
    content: '官为用，食伤生财，财生官，又食伤，财官都无力，只能靠运来助'
  },
  {
    indexString: '8,6,1,5,3,1,2,6',
    narrate: '丁火生于孟夏，柱中劫旺逢枭，天干壬无根，置之不用。最喜丑中一点财星，深藏归库，丑为湿土，能泄火气，不但不争无争夺之风，反有生生之谊。因初交丙午丁未，所以身出寒门，书香不继；喜中运三十载西土金地，化劫生财，财发十余万。所谓“吉神深藏，终身之福”也。',
    content: '食伤为用，喜土金，火旺不能直接用水克火，且水无根被克掉了'
  },
  {
    indexString: '4,4,1,1,4,10,7,9',
    narrate: '此造重重厚土，乙木无根，伤官又旺，其势足以敌官星之寡。故初交丙寅丁卯，官星得地，刑耗多端；戊辰得际遇，捐纳出仕，及已巳二十年，土生金旺，从佐二而履琴堂。至未运破金，不禄。',
    content: '比劫旺，用食伤泄秀，官星无根克去为妙，未运官星通根凶'
  },
  {
    indexString: '4,6,8,10,3,3,9,3',
    narrate: '此伤官当令 ，印星并见，官煞虽透无根，势在去官。初年运走北方，官星得势，一事无成；丙寅丁卯，生助火土，经营发财巨万；戊辰己巳，去尽官煞，一子登科，晚景峥嵘。此造戌午拱火，日时逢印，日主旺极，莫作用印而推，亦不可作去官留杀论也。',
    content: '去官用食伤泄秀为妙'
  },
  {
    indexString: '9,1,8,10,2,6,6,2',
    narrate: '丙火生于九月，日主本不及时，第坐阳刃会火局，谓之强寡。年干癸进气，癸水通根余气丑土，泄其火局，庚金生助壬癸为众也。势在成乎众，故交辛酉庚申，金生水旺，遗业丰盈，其乐自如；一交己未，火土并旺，父母双亡；及戊午二十年，破败家业 ，妻子皆伤，至丙辰流落外方而亡。',
    content: '官通根，财官为用'
  },
  {
    indexString: '2,2,6,2,0,8,1,1',
    narrate: '甲木生于立春后四日，春初木嫩，天气寒凝，日主坐申，月透庚金，丑土贴生申金，木嫩金坚，用火以攻之。喜得年于透丙，三阳开泰，万象回春，何其妙也！初运辛卯壬辰，有伤丙火，蹭蹬芸窗；癸巳运转南方，丙火禄旺，纳粟入监，运捷南宫；甲午乙未，宦海无波，申运不禄。',
    content: '木嫩金坚，用火攻之，财生杀克日主，用食伤克官杀'
  },
  {
    indexString: '6,10,5,3,0,2,3,3',
    narrate: '甲木生于仲春，坐禄逢刃，木旺金衰，用土以成之，方能化土生金，斩削以成真。初游幕，获利纳捐，至癸未运出仕；甲申乙酉，木无根，金得地，从佐二升知县而迁州牧。',
    content: '身旺官衰，用财官'
  },
  {
    indexString: '6,4,8,6,0,4,3,3',
    narrate: '甲木生于仲夏，时干丁火透出，用水以润之，然水亦赖金生，金亦赖水养；更妙支逢两辰，泄火生金蓄水，一气相生，五行俱足。是以早游泮水，科甲联登，仕至观察，一生惟丙戌运金水两伤不利，其余皆顺境。',
    content: '财官旺，食伤泄秀，用印比'
  },
  {
    indexString: '6,10,0,8,0,10,1,1',
    narrate: '甲木生于孟秋，财生杀旺，虽天干三透甲乙，而地支不载，木凋金锐，用土以从之也。格成从杀。戌运武甲出身；丁亥运生木克金，刑耗多端；戊子己丑，财生杀旺，仕至副将。',
    content: '杀旺身弱，从杀'
  },
  {
    indexString: '7,9,6,0,0,0,2,2',
    narrate: '甲木生于仲冬，木衰金寒，用火以暖之，金亦得其制矣；况平时逢禄旺，一阳解冻，所谓“得气之寒，遇暖而发”。故寒木必得火以生之也。所以科甲联登，仕至侍郎。',
    content: '用食伤'
  },
  {
    indexString: '2,0,5,11,2,2,4,0',
    narrate: '丙火生于孟冬，又逢两子，天干离衰，地支坎旺，用寅木以升之也。至壬寅，东方木地，采芹折桂；卯运出仕，一路运走东南，仕至观察。',
    content: '杀印相生，杀旺身浅用印'
  },
  {
    indexString: '8,6,8,2,8,10,6,10',
    narrate: '壬水生于孟春，支全火局，虽年月两透比肩，皆属无根。天干坎衰，地支离旺，用庚金以降之也。惜乎运途东南，在外奔驰四十年，一无成就；至五旬外，交戊申，娶妻三，年已六旬矣。连生三子，至戌运而终。',
    content: '身弱，印比无根，杀旺，用印'
  },
  {
    indexString: '2,0,2,0,2,0,2,8',
    narrate: '此造地支，两申两子，水逢生旺，金作水论；天干四丙，地支无根，离衰坎旺，须以木运和之也。惜乎五行不顺，五十年西北金水之地，故艰难险阻，刑伤颠沛；五旬外运走壬寅，东方木地，财进业兴，及癸卯甲寅，发财数万。',
    content: '身浅杀旺，用印'
  },
  {
    indexString: '9,5,8,10,8,6,8,2',
    narrate: '壬午日元，生于戌月，支会火局，年支坐巳，天干皆饮，地支皆离，必须金运以解之也。初交辛酉庚申，正得成其既济，解其财杀之势，叨化日之光，丰衣足食；一交己未，刑耗异常，戊午财杀并旺，出外遇盗丧身。',
    content: '身浅杀旺比劫无根，用印'
  },
  {
    indexString: '8,0,2,6,8,0,2,6',
    narrate: '此造水火交战于干支，火当令，水休囚，喜其无土，日和不克。初交丁未，年逢戊午，天克地冲，财杀两旺，父母双亡，流为乞丐；交申运逢际遇，己酉运发财数万，娶妻生子成家。',
    content: '财坐月令，身弱用印'
  },
  {
    indexString: '9,3,1,1,6,8,3,1',
    narrate: '此造寒金坐禄，印绶当权，足以用火敌寒。所忌者，年干癸水克丁为病，全赖月干乙木通根，泄水生火，此喜神即是财星也。更喜财星逢合，谓财来就我，其妻贤淑勤能，生三子，皆就书香。',
    content: '印重，财星为喜神，化伤官通官'
  },
  {
    indexString: '3,7,1,5,3,9,9,3',
    narrate: '丁火生于孟夏，柱中枭劫当权，一点癸水，不足相制，最喜坐下酉金，冲去卯木，生起癸水。出身贫寒，癸运入学，又得财巨万；壬运登科，辛丑选知县，仕至郡守。此造若无酉金，不但无财，而且名亦不成矣。',
    content: '印比重，财官为用'
  },
  {
    indexString: '1,1,6,4,2,8,8,4',
    narrate: '丙火生于季春，印绶通根生旺，日主坐财，时干又透壬水，必以乙木为用。可嫌者，乙庚化金，生杀坏印，其妻不贤，妒悍异常，无子而绝。财之为害。可畏哉！',
    content: '财杀重，克印，印比为用'
  },
  {
    indexString: '7,1,7,1,4,10,9,1',
    narrate: '此造日主旺，比劫多，年月伤官并透通根，丑为湿土，能生金蓄水，戌为火库，日主临之，不致寒冻也，是以农业富厚，更喜运走西方不悖，余虽断其多子，实不敢定其数目，询之云，自十六岁生子，每所得一子，连生十六子，并无损伤。此因命之美，印星不现，辛金明润不杂木火之妙也。',
    content: '比劫旺，用食伤'
  },
  {
    indexString: '9,11,0,0,3,9,9,3',
    narrate: '此造杀官当令，嫌其甲木透干，不能弃命从杀，只得杀重用印，则忌卯酉逢冲，去甲木之旺地。所生妻生八女，妾生入女，竟儿子。所谓身衰印作和，此财星坏印之故也，。',
    content: '官杀旺。但印通根不能从印，所以印为用'
  },
  {
    indexString: '1,7,7,5,4,10,3,5',
    narrate: '戊土生于巳月，柱中火土本旺，辛金露而无根；兼之己时，丁火独透克辛，局中全无湿气；更嫌年干乙木，助火之烈，所以克两妻，生十二子，刑逝十子。现存二子。',
    content: '印比旺，食伤被官杀克，用神无力'
  },
  {
    indexString: '4,0,9,11,8,10,0,4',
    narrate: '壬水生于孟冬，喜其无金，食神独透，所以书香小就，甲寅入泮，有十子皆育。其不妻者，无财之妙也；秋闱不利者，无地寅卯也。此造如戌土换之以木，青云得路矣。',
    content: '比劫旺，用财生杀，或架起食伤亦可'
  },
  {
    indexString: '6,2,2,10,7,11,7,3',
    narrate: '辛金生于戌月，印星当令；又寅 拱丙生天干，比劫不能下生亥水；又亥卯拱木，四柱皆成财官，二妻四妾生三子皆克，生十二女又克其九。还喜秋金有气，家业丰隆。',
    content: '用财生官'
  },
  {
    indexString: '3,9,3,7,4,10,3,5',
    narrate: '土生夏令，重叠印绶 ，四柱全无水气，燥土不泄火生金，克三妻五子。至丑运湿土晦火生金，又会金局，得一子方育。',
    content: '印比旺，前期命运无金从强，后走金有食伤泄秀，食伤即有子'
  },
  {
    indexString: '7,3,7,3,0,4,3,3',
    narrate: '此造春木雄壮，金透无根，喜其丁火透露，伤其辛金，所以已丑戊子运中，不但得子不育，而且财多破耗，丁亥支拱木而干透火，丁财并益，丙戌俞美，生五子，家业增新，由此观之，凡八字之用神即是子星，如用神是火，其子必在木火运星，或木火流年得；如不是木火运年得，必子息翕中多木火，或木火日主，否则难抬，或不肖，试之屡验，然命内用神，不物妻财子禄，而穷通寿夭，皆在用神一字定之，其可忽诸？',
    content: '比劫旺，用食伤泄秀生财生官'
  },
  {
    indexString: '9,3,1,1,2,0,5,1',
    narrate: '此造官印透而得禄，财星藏而归库，格局未尝不美，所嫌者，丑时伤官肆逞，官星退气，日主衰弱，全赖乙木生火而卫官。年月官印相生，亦出身官家，至亥支入泮；壬戌水通根，破耗异常加捐出仕，不过清规；至酉运，财星坏印，竟伏国刑。',
    content: '官印相生，不喜食伤，印克食伤吉，运又遇财星坏印凶'
  },
  {
    indexString: '1,3,3,11,4,6,2,4',
    narrate: '戊土生于孟冬，财星临旺，官印双清坐禄，日元临旺逢生，四柱纯粹可观，一行生化有情，喜用皆有精神，所以行运不破局，身出官家，连登科甲，五笔型五子皆登仁籍，富贵福寿之造也。',
    content: '原局流通好，富贵命，怕食伤运坏局'
  },
  {
    indexString: '3,5,7,11,4,0,4,6',
    narrate: '此造柱中三火二土，似乎旺相，不知亥子当权，冲坏印绶，天干火土虚脱，其祖上大富，至父辈破败；兼之初运西金地，生助旺水，半生颠连不遇。及交丁未，运转南方，接连丙午二十年，大遂经营之愿，发财十余万。',
    content: '食伤和财坏印，印比为用，年柱为印则祖上大富'
  },
  {
    indexString: '1,11,7,5,2,4,9,5',
    narrate: '此造支逢两禄乘权，年干印透通根，凡推命者，作旺论用，以财星断其名利双收，然丙火生孟夏，火气方进，年干印绶 ，被月干财星所坏，巳亥逢冲，破禄去火，则金反得生扶，木火失势。又坐下辰土，窃去命主无神，时癸盖头，巳火亦伤，必作弱推，用以巳火，初运东方木土，出身遣业丰百姓；丙子火不通根，官得地，家多破耗；丑运生金泄火，刑克异常，家业十去八九，夫妇皆亡。',
    content: '财坏印，官星透干，食伤泄秀，用印比'
  },
  {
    indexString: '3,11,8,2,2,0,3,9',
    narrate: '丙火生于春初，谓相火有焰，不作旺论。月干壬水通根，亥子杀旺无制，喜其丁午寅亥合而化印，以杂为恩。时支财星，生官坏印，以杂为恩。时支财星，生官坏印，又得丁火盖头，使其不能克木，所以同胞七人，皆就书香，而且兄爱弟敬。',
    content: '财官旺，喜印比，妙在比劫挡一部分官杀，又比劫克财使其无力克印'
  },
  {
    indexString: '9,5,4,6,2,6,6,2',
    narrate: '此造羊刃当权，又逢生旺，更可嫌者，戊癸合而化火，财为众劫所夺，兄弟六人，皆不成器，遭累不堪。余造年月日皆同，换一壬辰时，弱杀不能相制，亦有六弟，得力者早亡，其余皆不肖，以致拖累破家。总之劫刃太旺，财官无气，兄弟反少，纵有，不如无也。然官杀太旺亦伤残，秘须身财并旺，官印通根，可敦友爱之情。',
    content: '印比太旺，用财官'
  },
  {
    indexString: '0,8,2,0,8,2,7,11',
    narrate: '壬水生于仲冬，羊刃当权，年月木火无根，日支食神冲破，似乎平常。然喜日寅时亥，乃木火生地；寅亥合，则木火之气愈贯；子申会，则食神反得生扶，所谓财气通门户也。富有百余万，凡巨富之命，财星不多，只要生化有情，即是财气通门户，若财临旺地，不宜见官，日主失令，必要比劫助之，期为美也。',
    content: '印比重，用食伤和财'
  },
  {
    indexString: '8,8,2,6,9,11,4,6',
    narrate: '癸水生于仲夏，又逢午时，财官太旺。喜其日元得地，更妙年干劫坐长生，财星有气，尤羡五行无木，财水泄而火无助，壬水可用。且运走西北，金水得地，遗绪不丰，自创四五十万，一妻四妾八子。',
    content: '财官太旺，用印比'
  },
  {
    indexString: '9,3,9,11,3,3,7,11',
    narrate: '此造官杀乘权，原可畏也，然喜支拱印局，巧借栽培，流通水势，官星有理会。第嫌初运庚申辛酉，生杀坏印，偃蹇功名；己未支全印局，干透食神，云程直上，仕至尚书。然有其命必得其运，如不得其运，一介寒儒矣。',
    content: '官旺印弱用印，运走未亥卯未三合吉'
  },
  {
    indexString: '9,9,3,5,2,6,8,4',
    narrate: '丙火生于孟夏，坐禄临旺，喜其巳酉拱金，财生官，官制劫，更妙时透壬水，助起官星，以成既济。三旬外运走北方水地，登科发甲，名利双辉。勿以官杀混杂为嫌也，身旺者，必要官杀混杂而发也。',
    content: '身旺用财官'
  },
  {
    indexString: '0,6,2,2,7,9,5,1',
    narrate: '此造财临旺地，官遇长生，日主坐禄，印绶通根，天干四字，地支皆临禄旺，五行无水，清而纯粹。春金虽弱，喜其时印通根得用，庚运帮身。癸酉看登科；午运杀旺，病晦刑丧；辛运己卯年发甲入词林；后运金水帮身，仕路未可限量也。',
    content: '财官稍旺，身杀两停，不喜运助财官，要保持身杀两停'
  },
  {
    indexString: '1,5,7,5,6,4,0,8',
    narrate: '庚金生于立夏前五日，土当令，火未司权，庚金之生坐实，且辰支申昌，生扶并旺，身强杀浅。嫌其财露无根逢劫，所以出身贫寒；一交丁运，官星元神发露，戊寅己卯两年，财星得地，喜用齐来，科甲联登，又入词林。书云，“以杀化权，定显露门贵客”，此之谓也。',
    content: '身强，财被克无力，喜财为用'
  },
  {
    indexString: '8,0,4,8,4,10,7,9',
    narrate: '戊土生于孟秋，支在西方，秀气流行，格局本佳，出身大富。所嫌者，年干壬水能根会局，则财星反不真矣。兼之运走西北金水之地，所以轻财重义，耗散异常，惟戌运入泮得子。辛亥壬子贫乏不堪。',
    content: '身弱食伤旺，食伤生财，身弱抗不住财旺，财坐年柱祖上有钱，后扛不住破耗异常，后运遇杀，财生官又官和食伤相克有冲突'
  },
  {
    indexString: '9,3,0,2,3,5,5,9',
    narrate: '此造财藏杀露，杀印相生，又联珠相生，似乎贵格，所以祖业二十余万；不知年干之杀无根，其菁华尽被印绶窃去，必用酉金之财。盖头覆之以土。似科有情，但木旺土虚，相火逢生，则巳酉不会，财不真矣。一交壬子，泄金生木，一败如灰；至亥支，印遇长生，竟遭饿死。',
    content: '身旺，把官杀化掉了'
  },
  {
    indexString: '6,6,8,6,2,2,6,2',
    narrate: '此夏火逢金，财滋弱杀，两支不杂，杀刃神清，定然名利双辉。不知地支木火，不载金水，杯水车薪，不但不能制火，反泄财星之气，夏月庚金败绝，财之不真可知矣。早运癸未、甲申、乙酉土金之地，丰衣足食；一交丙戌，支全火局，刑妻克子，破耗异常，数万家业，尽付东流；丁亥合壬寅而化木，孤苦不堪而死。',
    content: '身旺用财官'
  },
  {
    indexString: '1,3,1,9,6,2,8,6',
    narrate: '秋金乘令，财官并旺，食神吐秀，大象观之，富贵之命。第财星太重，官星拱局，日主反弱，不任其财官，全赖劫刃扶身，被卯冲午克，时干壬水，不能克火，反泄日元之气，财财星不真矣。初运甲申禄旺，早年入泮，其后运走南方 ，贫乏不堪。',
    content: '财旺身弱，印比为用'
  },
  {
    indexString: '7,1,2,8,9,5,6,8',
    narrate: '此财星坐禄，一杀独清，似乎佳美，所嫌者，印星太重，丑土生金泄火，丙辛合而化水，以财为用，申又合巳，则财更不真。初运乙未甲午，木火并旺，祖业颇丰；一交癸巳，皆从申合，一败如灰，竟为乞丐。',
    content: '印太旺，用财官'
  },
  {
    indexString: '6,4,1,9,3,1,1,5',
    narrate: '丁火日元，时逢旺地，两印生身。火焰金叠，似乎富格，不知月干乙木，从庚而化，支会金局，四柱皆财，反不真矣。祖业亦丰，初运丙戌丁亥，比劫帮身，财喜如心；戊子已丑，生金晦火，财散人离，竟冻饿而死。',
    content: '财太旺了，用印比'
  },
  {
    indexString: '3,1,7,0,3,11,0,4',
    narrate: '丁火生于仲冬，干透壬水，支全亥、子、丑北主，官星旺格；辰乃湿土，不能制水，反能晦火，谓清枯之象，官星反不真也。喜其无金，气势纯清，其为人学问真确，处世无苟，训蒙度日，苦守清贫，上等官星不见也。',
    content: '官旺身弱用印比'
  },
  {
    indexString: '2,4,6,2,2,6,8,4',
    narrate: '此造财绝无根，官又无气，兼之运走东南之地，幼年丧父，依母转嫁他姓；数年母死，牧牛度日，稍长则卖力佣工；后双目失明，不能佣作，求乞自活。',
    content: '财官无力，印比过旺，喜用财官'
  },
  {
    indexString: '3,3,0,4,7,11,9,5',
    narrate: '此春金逢火，理宜印化杀，财星坏印，癸水克丁，亥水冲巳，似乎制杀有情，不知春水休囚，木火并旺，不但不能克火，反去生木泄金；财官本可荣身，而日空不能胜任，虽心专必欲求之。亦何盖哉！出身未属微贱。初习梨园，后因失音随官；人极伶俐，且极会趋逢，随任数年，发财背主，竟损纳从九品出仕，作威作福，无所不为；后因犯事革职，依然落魄。',
    content: '财官太旺又食伤泄身太重伤官见官，用印比'
  },
  {
    indexString: '0,0,2,2,4,2,5,7',
    narrate: '春初土虚，杀旺逢财，以丙火为用，喜其财印相隔，生生不悖；更妙未时帮身为喜，四柱纯粹，主从得宜。所以早登甲第，一生有吉无凶，仕至观察，后退归优游林下，生六子皆登科第，夫妇齐眉，寿越八旬。',
    content: '财官旺，又有比劫助身，印为用'
  },
  {
    indexString: '2,8,5,11,6,4,4,2',
    narrate: '此寒金喜火，得时支寅木之生，则火有焰，然有财杀，必先身旺。妙在年支坐禄，三印贴生，更妙亥水当权，申金含生忘冲。无火则土冻金寒，无木则水旺火虚，以火为用，以木为喜，木火两字，缺一不可。所以生平无凶无险，登科发甲，宦海无波，后裔济美，寿至八旬之外。',
    content: '印比旺，官杀为用，财为喜'
  },
  {
    indexString: '1,11,4,2,2,0,0,6',
    narrate: '丙火生于寅月，印星当令，时逢刃旺，甲乙并旺透，四柱无金；寅亥化木，子水冲破，官星无用，必以月干戊土为用 。忌神即是甲木，亥子之水，反生旺木，所谓忌神辗转攻也。初交丁丑，生助用神，祖业十余万，其乐自如；一交丙子，火不通根，父母双亡，连遭回禄；乙亥水木并旺，又遭回禄，克三妻四子，赴水而亡。',
    content: '印比旺，官杀被克无用且生印，食伤为用，喜财来克印食伤泄秀'
  },
  {
    indexString: '7,5,6,2,2,4,5,1',
    narrate: '丙火生寅，木嫩火相，未为旺也，生丑时，窃去命主元神，以寅木为用。所嫌庚金当头之忌，木嫩逢金，火虚见泄。初交己丑戊子，生金泄火，幼丧父母，孤苦不堪；丁亥丙戌，火在西北，不能去尽忌神，所以历尽风霜，稍成家业；一交乙酉，干支皆化忌神，刑妻克子，遭水厄而亡。',
    content: '财和食伤强，身弱，用印，官为忌神，财会生官克身'
  },
  {
    indexString: '7,1,9,5,0,0,2,2',
    narrate: '此从巳火起源头，生丑土，丑土生辛金，辛生癸，癸生甲，甲生丙火；甲禄居寅，癸禄居子，丙禄居巳，官坐财地，财逢食生，五行元刘皆厚 ，四柱通根生旺，左右上下有情，为人刚柔相济，仁德兼资，贵至三品，富有百万，子十三人，寿至百岁，无疾而终。',
    content: '流通很好'
  },
  {
    indexString: '5,9,1,11,2,2,4,0',
    narrate: '此以酉金为源头，生亥水，亥水合寅而生丙，丙火生戊土，元神皆厚。乡榜出身，仕至观察，为人宽厚端方，九子二十四孙，富有百余万，寿至百二十岁，无疾而终。',
    content: '流通很好，印比为用'
  },
  {
    indexString: '5,9,7,7,8,2,8,2',
    narrate: '此以未土为源头，生辛金，辛金生壬水，壬水生寅木，四柱生化有情，元神厚而纯粹。所喜者，火喜其包藏不露。早登科甲，仕至三品；为人品行端方，廉和仁厚；八子十九孙，寿至九旬有六。',
    content: '官印相生，藏干有财，流通好'
  },
  {
    indexString: '3,7,6,10,6,4,2,0',
    narrate: '此以丁火为源头，生土，土生金，两藏财库，身旺用官。中年行运不背，所以早登乡榜，名利双辉。为人有刚明决断之本，无刻薄欺瞒之意。惜乎无木，火之元神不足，孙枝虽旺，子息未免多损之忧。',
    content: '喜财来生官'
  },
  {
    indexString: '1,7,4,2,1,3,6,4',
    narrate: '此支类东方，正曲直仁寿格，大势观之，财官有气，名利裕如。第五行火不出现，财之元神虚脱，寅卯东方木旺，官司星之根亦薄。所以一生操剥削，资囊未满先倾，且平生仗义疏财；为人无骄谄，存古道，苦守清贫；生四子皆得力，寿至九十四岁。',
    content: '食伤为用，财官力不强'
  },
  {
    indexString: '9,1,0,2,4,10,6,8',
    narrate: '戊戌日逢庚申时，食神有力，杀旺无印，足以强制。生八九子，有三四子贵显而授一品之诰封者，土金有情之妙也。其为人贪恶两备者，不能化杀之故也，淫靡无礼者，火不现，水得地之故也。盖寅申冲，则丙火必坏，丑戌刑则丁火亦伤，兼之癸水透，则日主之心志必合，而求之不顾；寅戌支藏之火，暗中克尽，夫火司礼，为人岂可无礼？无礼则无所不为矣！设使年干癸水，换于丁火，未有不仁德者也。其富贵福寿，皆申时之力，亦祖德宗功所致也。后生落头疽而死，由已积恶多端，而天诛之矣。',
    content: '食伤旺，财杀也两旺，用比劫'
  },
  {
    indexString: '4,4,6,8,5,3,4,4',
    narrate: '此土金伤官，辰中癸水，正财归库，申中壬水，正财逢生，劫虽旺，而不能夺；且土气尽归于金，伤官化劫，暗处生财，兼之独杀为权，故为人权谋异众，地支皆阴湿之气，作事诡谲多端，一生所重者财，而少仁义，至四旬无子，娶两妾又无子。寿至九旬外，异财如命，卒后家业四十余万，分夺而尽。细究之，皆因财星守于藏蓄，不得流行之故也，财不流行，秋金逢土而愈坚，生意遂绝耳，大凡财厚无子者，皆类此格，故无子之人，其性情必多鄙吝，不知财散则民聚，倘使富人无子能轻其财于亲族之中，分多润寡，何患无子哉？即如此造，金气太坚，水不露头，未得生生之妙，能散其财，则金自流行，子必招矣。然散亦有功过，散财于僧道，有过无功；散财于亲族，有功无过。修德获报，人事原可挽回；作善隆祥 ，天心讵难感召，寿本五福之首，寿而无子，终于无益；与其富寿而无子，不若贫寿而有子也。',
    content: '官弱，又无财通关'
  },
  {
    indexString: '1,1,1,9,2,4,7,3',
    narrate: '此造三印扶身，辰酉合而不冲，四柱无水，似呼中格。第支皆湿土，晦火生金，辰及木之余气，与酉合财，木不能托根，与酉化金，则木反被其损，天干两乙，地支不载，凋可知矣，由此推之，日元虚弱，至午运，破酉卫卯，得一子；辛巳全会金局坏印，则元气大伤，会财则财极必反，夫妇双亡。',
    content: '财旺印弱，忌财'
  },
  {
    indexString: '5,1,4,4,7,11,4,10',
    narrate: '此重重厚土，埋藏脆嫩之金，五行无木，未得疏扬之利；一点亥水克绝，支藏甲乙，无从引助；然春土气虚，藏财可用，初运东方木地，疪荫有余；寅运得一子。乙丑运，土又通根而夭。',
    content: '印过旺，喜财克印又食伤生财克印'
  },
  {
    indexString: '8,2,8,2,0,2,8,8',
    narrate: '春木重逢禄，支得申时，似乎时杀留清，不知木旺金缺，必要有火有佳；天于三壬，寅中丙火受克，神枯可知。至丙支，逢三壬回克，家业败尽，夭而无子。凡水木并旺无土者，最忌火运，即不伤身，刑耗异常。若俗论必用申金，两火克金之故也。如丙火克金为害，则前之乙已运，紧克申金，而且三刑，何反美乎？',
    content: '印比太旺官无力，用财克印生官，原局不见食伤，突然见食伤对日主消耗极大'
  },
  {
    indexString: '7,1,7,1,9,9,9,1',
    narrate: '此重重湿土，叠叠寒金，癸水浊而且冻，所谓阴之甚，寒之至者也。毫无生发，气浊神枯，故春人愚昧不堪，一事无成，至戊戌运，生金克水而夭。以俗论之，两干不杂，金水双清，地支三杀，杀印相生之美，定为贵格，前则春木带嫩金。斩削成大器，皆作名利两全之格也，不知夭命，皆类此格，学者宜深究之。',
    content: '看似身杀两停，但是整个命格偏枯湿寒，容易出现大的变故，如走正印可能不会如此，偏印导致此种'
  },
  {
    indexString: '4,8,0,2,8,2,3,7',
    narrate: '壬水生于孟春 ，土虚木盛。制杀太过。寅申逢冲，本是克木，不知木旺金缺。金反被伤，则戊土无根依抚，而日主之壬水，可任性而行，见其财星有势，自然从财而去，以致伤夫败业，弃子从人也。',
    content: '食伤旺用印'
  },
  {
    indexString: '3,7,1,5,0,6,3,3',
    narrate: '甲午日元，生于巳月，支类南方，干透两丁。火势猛烈。泄气太过，局中无水，只可用劫。初运又走火地，是以早刑夫主。人极聪明美貌，而轻佻异常，不能守节。至戊申运，与木火争战，不堪言矣。',
    content: '食伤过旺用比劫'
  },
  {
    indexString: '4,10,5,7,2,4,4,10',
    narrate: '满局伤官，五行无木，印星不现，格成顺局，故其人聪明美貌。第四柱无金，土过燥厚，辛金夫星投墓于戌，是以淫乱不堪。夫遭凶死，又随人走，不二三年又克，至乙卯运，犯土之旺，自缢而死。',
    content: '从儿格，忌助日主'
  },
  {
    indexString: '4,6,1,1,4,10,2,4',
    narrate: '戊土生于丑月，土旺用事，木正凋枯，且丑乃金库，辛金伏藏，不能托根；更兼辰戌冲去藏官，置夫主于度外，且中运西方金地，淫贱不堪。',
    content: '印比重官无力'
  },
  {
    indexString: '5,11,2,2,3,11,6,10',
    narrate: '丁火生于寅月，木正当权，火逢相旺，必以亥水官星为夫明矣。年支亥水合寅化木，而日支亥水，必要生扶为是；时干庚金隔绝，无生扶之意，又逢戌土紧克之，则日主之情，必向庚金矣。所以淫贱之至也。',
    content: '官星受伤，用财生官'
  },
  {
    indexString: '3,7,9,1,6,0,3,11',
    narrate: '寒金喜火，嫌其支全亥子丑。北方水旺，又有干癸克丁，丑未冲去丁火余气，五行无木，未得生化之情。时干之丁虚脱无根，焉能管伏庚金？而日主之情，不顾丁火可知，所以水性杨花也。',
    content: '食伤重，用财通关'
  },
  {
    indexString: '3,1,9,1,6,0,1,9',
    narrate: '庚金生于季冬，不但寒金喜火，而且时逢阳刃印绶当权，足以用火敌寒；月干癸水，通根禄支，克绝丁火，其意足以欺官；时逢乙木，喜而合之，其情必向财矣。所以背夫而去，淫秽不堪也。',
    content: '食伤重，官被克'
  },
  {
    indexString: '3,1,8,0,7,5,2,8',
    narrate: '壬水合去丁火之杀，丙火官星得禄于日支，似乎佳美,所以出身旧家，因其貌美而菁媚。群以赛杨妃称之。四五岁时，眉日秀丽，及十三四益娇冶，成为画中人。年十八，归士人妻，士素醇谨好学，惑而昵爱之，逾年而学废，竟以痨病而死。从此淫秽不堪，后身败名裂。无所依托，自缢而死。此造因多合之故耳。夫十士之合。以官化伤官 ，谓贪合忘官，且巳申合亦化伤官，丁壬合则暗化财星，其',
    content: '合食伤克官杀凶'
  },
  {
    indexString: '4,0,4,6,9,9,4,6',
    narrate: '癸水生于午月，财官并旺，坐下印绶，年支坐禄，未尝不中和。天干三透戊土，争合癸水，则日主之情，竟无定见；地支两午坏酉，而财官之势，不分强弱，日主之情，自然依财势而去。只有年干正夫无财势。其力量不敌月时两干之官，故将正无置之不顾矣。运至乙卯，木生火旺，月时两土，仍得生扶，年干之土无化而受克，所以夫得疾而死，后淫秽异常，尤物祸人，信哉！',
    content: '官旺用印比'
  },
  {
    indexString: '1,7,7,5,1,11,2,10',
    narrate: '年月日六字观之，乙木生于巳月，伤官当令，最喜坐下亥印冲巳制伤，不特日主喜其滋扶，抑且辛金得其卫美，正所谓伤官用印，独杀留清，不但貌美，而且才高，书画皆精。所嫌戌时紧克亥水，暴阳一透，辛金受伤，既不利于夫子之宫，兼损坏乎生平之性矣。',
    content: '伤官旺克杀，配印吉'
  },
  {
    indexString: '3,5,4,8,9,1,1,3',
    narrate: '此造官星食神坐禄，印绶当令逢生，财生官旺，不伤印绶 ，印绶当令，足以扶身，食神得地，一气相生，五行停匀，安详纯粹。夫荣子贵，受两代一品之封。',
    content: '流通好，印比相对弱用印比'
  },
  {
    indexString: '5,11,9,9,0,4,2,2',
    narrate: '八月官星财星助金，生于寅时，年时两支逢生得禄，火水干透，无相克之势，有生化之情。财星得地，四柱通根，五行不悖，气静和平纯粹，生化有情。夫荣子贵，受一品之封。',
    content: '流通好，喜印运'
  },
  {
    indexString: '7,9,8,4,3,5,0,4',
    narrate: '伤官虽旺，合酉化金，则官星之元神愈厚矣。巳火拱金，辰土引之，则财之元神更固矣。时透印绶 ，助日主之光辉，制辰土之伤官，所谓木不枯，火不烈，水不涸，土不燥，金不脆，气静和平之象。夫荣子贵，受一品封。',
    content: '流通好，喜用印'
  },
  {
    indexString: '5,5,9,9,8,4,0,4',
    narrate: '秋水通源，印星秉令，官杀虽旺，制化合宜 ，更妙时透甲木，制杀吐秀，一派纯粹之气，所以人品端庄，精于诗书。喜运途无火。官不助，印不伤，夫星贵显，子嗣秀美，诰封二品之荣。',
    content: '流通好，官杀虽旺喜在食伤制杀，忌运走财克印生官'
  },
  {
    indexString: '6,4,8,6,1,11,9,7',
    narrate: '木生午月，火势猛而金柔脆之时，喜壬癸通根制火，辰土泄火生金，则火土不烈燥，水木不枯涸，接续相生，清而纯粹。为女中才子，生三子，夫任京官，家道清寒。在家教子读书，二子登科，一子发甲，夫官郎中，子官御史，受二代之封。',
    content: '流通好，财能量不那么足'
  },
  {
    indexString: '6,4,4,2,1,9,8,6',
    narrate: '乙木生于春初，木嫩金坚，最喜午时制杀卫身，寒木向阳，官印双清，财星生官，不坏印绶，纯粹安和。夫官二品，五子二十三孙，一生无疾，夫妇齐眉，寿至八旬外，无疾而终，后裔皆显贵。',
    content: '流通好，官杀和身都有能量，官杀稍弱运补齐身杀两停'
  },
  {
    indexString: '2,4,9,5,3,1,0,4',
    narrate: '丁火生于巳月，癸水夫星清透，时干甲木，印绶独清，是以品格端庄，持身贞洁。惜丙火太旺，生助伤官，以臻镜破钗分。然喜巳丑拱金，财星得用，身旺以财为子，教子成名，两子皆贵，受三品之封。',
    content: '官杀能量弱，喜运财生官'
  },
  {
    indexString: '2,2,7,3,9,9,4,6',
    narrate: '癸水生于仲春，泄气之地，兼之财官并旺，日元柔弱，以印为夫，清而得用，是以秉性端庄，勤俭纺织。至丑运，泄火拱金，连生二子；戊子运冲去午火，不伤酉金，夫主登科发甲；一交丁亥，酉归矣。此造之病，实在财旺耳。天干之辛，丙火合之，地支之酉 ，午火破之，更兼寅卯当权生火，丁亥运合寅化木，助起旺神，又丁火紧克辛金，不禄宜矣。',
    content: '官星能量弱，用财官'
  },
  {
    indexString: '7,1,7,3,2,0,9,5',
    narrate: '丙火生于仲春，火相木旺之时，正得中和之象，年月两透财星，地支巳丑拱金，财旺生官，官星得禄，以印为夫，谓真神得用。秉性勤俭，纺织佐读，奉甘旨得舅姑之欢心。至甲午运帮身卫印，夫主运登甲榜，诰封宜人；寿至酉运，会金冲卯不禄。',
    content: '印为用，财杀重'
  },
  {
    indexString: '3,9,9,3,2,4,2,8',
    narrate: '丙火生于仲春，官透财藏，印星秉令，比劫邦身，似乎旺相。第嫌卯酉逢冲，癸丁相克，木火损而金水存 ，虽赖时干丙火之助，但丙临申位，亦自顾不暇。幸辰中蓄藏余气，一点微苗，尚存春令，犹能备用，较之前造更弱，亦以印星为夫，为人端庄幽娴，知书达理，丙午运，破其酉金，夫主癸科，生二子，诰封四品；至四旬外，运走戊申，泄火生金不禄。',
    content: '日主能量比较弱，喜印比'
  },
  {
    indexString: '9,1,6,8,4,6,5,7',
    narrate: '戊土生于孟秋，柱中劫印重重，得食神秉令夫，泄其菁英，更喜癸水润土养金，秀气流行，是以人品端庄，知大义，虽出农家，安贫纺织佐夫，孝事舅姑。至癸亥，夫举于乡，施登甲榜，仕至黄堂，虽夫贵，夫尝以贵妇自矜，在家仍布衣操作。生四子，皆美秀，寿至丙运，夺食不禄。',
    content: '流通好，喜财生官'
  },
  {
    indexString: '9,7,6,8,4,10,5,7',
    narrate: '此与前造，只换未戌二支，其余皆同。未丑皆土，午换以戌，用金去火为宜。大势观之，胜于前造，今反不及者何也？夫丑乃交北方湿土，能生金晦火，又能蓄水；未乃南方燥土，能脆金助火，又能枯水，午虽火，遇丑土而贪生，戌虽土，藏火而愈燥 。幸秋金用事，所以贵也。虽出身贫寒，而人品端谨，持家勤俭。夫中乡榜。仕县令，生二子。',
    content: '财能量不足，财为用'
  },
  {
    indexString: '5,9,7,7,4,4,8,10',
    narrate: '土荣夏令，逢金吐秀，更喜无木，富贵之造也。所以身出宦家，通诗书，达礼教。至酉运，夫星禄旺，生一子，夫主登科。甲戌运刑冲出丁火，闺中雪舞，而家道日落，青年守节，苦志教子成名。至子运，子登科 ，仕至郡守，受紫诰之封，寿至寅运金绝之地。',
    content: '财为用'
  },
  {
    indexString: '3,11,8,0,9,1,0,2',
    narrate: '癸水生于仲冬，支全亥子丑，北方一气，其势泛滥，一点丁火无根，最喜寅时，纳水而泄其菁华。甲木夫星坐禄，故为人聪明貌美，端庄幽娴；更喜运走东南木火之地，夫荣子秀，福泽有余。',
    content: '身重杀轻，用财官'
  },
  {
    indexString: '1,3,2,10,1,3,3,11',
    narrate: '乙木生于季秋，柱中两坐禄旺，亥卯又拱木局，四柱无金，日元旺矣。喜其丙丁并透，泄木生于土。财星为夫，为人端庄和顺，夫中乡榜，出仕琴堂。生三子，寿至壬运。',
    content: '身旺，喜财官，喜食伤生财'
  },
  {
    indexString: '4,2,0,2,3,7,7,1',
    narrate: '丁火生于春令，印绶太重，最喜丑时，坐下财库，冲去未中比印，生起财星，必以辛金为夫，丑土为子也。初运北方水地，泄金生木，出身寒微；至庚戌、己酉、戊申三十载土金这地，裕夫发财，生三子皆贵，诰封恭人。所谓弃印就财，且夫得子助。故后嗣荣发也。',
    content: '印重喜财官'
  },
  {
    indexString: '8,4,5,9,7,1,9,5',
    narrate: '辛金生于仲秋，支全金局，五行无木，火已成金，必无用官之理。喜其壬癸并透，泄其精英，为了聪明端谨，颇知诗礼。所惜者，十九岁运走丁未，南方火旺，生土逼水，流年庚戌，支全克水，无子而夭。',
    content: '印比旺，官被克尽，用财通关'
  },
  {
    indexString: '0,6,2,2,1,3,5,3',
    narrate: '旺木逢火，通明之象，妙在金水全无，纯清不杂，为了端庄。以丙火为夫，惜运走北方水地，寿亦不永，生三子留一，至壬运，克丙火而阻矣。设使两造运皆顺行，不特寿长，若男造名利两全，女造则夫荣子贵也。',
    content: '食伤泄秀，喜用财，运走的不是很好'
  },
  {
    indexString: '3,7,8,2,1,3,5,3',
    narrate: '春木森森，旺之极矣。时干己土无根，以丁火为主。丁壬之合，去水却妙，化木不宜，所以出身贫寒。喜其运走南方火地，不但帮夫兴家，而且子息亦多，寿至申运，壬水逢生而阻。此与前造论之，不及前造，此造由行运不背，故胜之。然而命好不如运好。男女皆然也。',
    content: '身重，喜财来通关'
  },
  {
    indexString: '7,1,9,5,2,0,3,9',
    narrate: '丙火生于巳月，虽云建禄，五行无木生助。天干既透财官，地支不宜再见酉子，更不宜再会金局，则巳火之禄，非日干有也。虽丁火可以帮身，癸水伤之，谓财多身弱，兼之官星又旺，日主虚弱极矣。且初交壬运逢杀，辛亥年天干逢壬癸克丙丁，地支亥冲巳破禄，运根拔尽，得疳疾而亡。',
    content: '杀旺身弱'
  },
  {
    indexString: '9,1,5,7,2,2,7,3',
    narrate: '前造因财官太旺，以致夭亡，此则日坐长生，又生夏令，财官为用，伤官为喜，伤生财，财又生官，似乎生化有情。殊不知前则财多身弱，以官作杀，此则财绝官休，恐难厚享。癸水官星生未月，火土枯干，余气在丑，蓄水藏金，然己土当头伤癸，丑未冲去金水根源，时上辛又临绝，虽有若无，焉能生远隔之水？则己土亦不能生隔绝之金。且运走东南木火这地，断非守业之人也。',
    content: '伤官见官败家叛逆，食伤泄秀喜走食伤运或财运'
  },
  {
    indexString: '6,10,8,6,2,2,5,11',
    narrate: '丙用壬杀，身强杀浅，以杀化权；更喜财滋弱杀，定然名利双全。惜支全火局，寅亥又化木而生火，年月之庚壬无根而少生扶，至丁巳年，巳亥冲去壬水之禄，丁火合去壬水之用，死于疳症。',
    content: '身旺财杀弱，用财杀'
  },
  {
    indexString: '8,8,4,8,8,8,4,8',
    narrate: '壬水生于秋令，地支皆坐长生，天干两戊两壬，大势观之，支全一气，两干不杂，且杀印相生，为大贵之格。不知金多水浊，母多子病，四柱无火克金，金反不能生水，戊土之菁华尽泄于金，谓偏枯之象，必然难养，名利皆虚，果死于三岁甲戌年。',
    content: '印重杀弱用财杀'
  },
  {
    indexString: '8,8,0,4,8,8,4,8',
    narrate: '壬水生于季春，似乎杀印相生，地支三遇长生，食神制杀为权，定为贵格。不知春土气虚，月透甲木，不但辰土受制，而时干之戊，亦受其克。五行无火，未得生生之妙，亦母多子病，偏枯之象，必然难养也。后死于痘症。',
    content: '印重，食伤无力，克杀杀亦无力，运走财于印直接相克凶'
  },
  {
    indexString: '9,1,8,10,3,11,8,2',
    narrate: '此造丁火阴柔，生于深秋，杀官重叠，必不能养。殊不知官杀虽旺，妙在戌月，通根身库，足以制水；更妙无金，时支寅木不伤，气贯生时，足以纳水，不但易养成人，可遂书香之志。然官杀一类，勿以官为喜，杀为憎，身弱者官皆是杀，身旺者杀皆是官，只要无财有印，便为佳造。如云丁火死寅，谬之极矣。寅中甲木，乃丁之嫡母，何以为死？凡阴干以生地为死，死地为生，非正论也。果幼年无疾，聪慧过人，至甲戌年入泮后。运走南方火土，制杀扶身，未可限量也。',
    content: '官旺，喜无财坏印'
  },
  {
    indexString: '8,10,0,4,3,9,5,9',
    narrate: '此造概云木透月干，春木足以生火，年干壬水生木，日时两坐长生，皆作旺论。惜地支土金太重，天干水木之根必浅，水木无气，则丁火之荫不固。夫甲木生于季春，退气之神也，辰酉合而化金，则甲木之余气已绝；戌土隔之，使金不能生水，戌土足以制之，壬水受克，不能生木；辰酉化金，必能克木，日主根源不固可知，如谓酉是丁火长生，五行颠倒矣。酉中纯辛，无他气所杂，金生水，无生火之理。火到酉位，死绝之地；更嫌时干己土，窃去命主元神，生金泄火，而水木火三字皆虚矣。后果夭于癸酉年。由此论之，小儿之命，不易看也。',
    content: '财旺，身弱且印弱，食伤克官又影响生印，食伤生财，印弱化不动官且被财克，需用印比'
  },
  {
    indexString: '9,9,4,6,6,2,3,1',
    narrate: '庚金生于仲夏，正官得禄，年时酉丑通根，正得中和之气。寅午财官拱合，财不坏印，官能生印，财官印三字，生化不悖，癸从戊合，去其阴浊之气，所以品行端方，恒存古道。早游泮水，训蒙自守；丁酉登科，后挑知县不赴，情愿就教，安贫乐道。有人言其小就者，片曰：功名者，非掇巍科登高位而为功名也，功成名自著，况吾无经济材，就教职不悉衣食不敷，吾行吾志，不负君父之恩足矣！',
    content: '身稍弱，官重印无力，运中印被合化也无力，有多大的能耐做多大的事儿，也算安逸'
  },
  {
    indexString: '2,2,6,0,5,11,0,10',
    narrate: '己土生于仲冬，寒湿之体，水冷木凋，庚金又克木生水，似乎混浊。妙在年干透丙，一阳解冻，冬日可暖，去庚金之浊，不特己喜其和暖，而甲木亦喜其发荣；更妙戌时燥土，砥定泛浊之水，培其凋枯之木，而日主根元亦固。况甲己为中和之合，故处世端方，恒存古道，廉恭和厚，有古君子之风；微嫌水势太旺，功名不过禀贡。',
    content: '财官旺，用印'
  },
  {
    indexString: '2,10,7,1,5,3,0,0',
    narrate: '此造水冷金寒，土冻木凋，得年干透丙，一阳解冻，似乎佳美。第丙辛合而化水，以阳变阴，反增寒湿之气。阳正之象反为阴邪之类，故其为人贪婪无厌，奸谋百出，趋财奉势，见富贵而生谄容，势利骄矜。所谓多能之象也。',
    content: '财官重，喜印'
  },
  {
    indexString: '4,4,0,0,8,0,7,11',
    narrate: '壬水生地仲冬，三逢禄旺，所谓昆仑之水，可顺而不可逆也。喜其子辰拱水，则戊土之根不固，月干甲木为用，泄其泛滥之水，此即局中显奋发之机也。运至丙寅丁卯，寒木得火以发荣，去阴寒之金土，是以早登甲第。翰苑名高；至戊辰运，逆水之性，以致阻寿。',
    content: '身强，用食伤泄秀，喜财生官，忌官直接和身冲'
  },
  {
    indexString: '0,8,2,0,9,11,9,11',
    narrate: '癸水生于仲冬，三逢旺支，其势汪洋，喜其甲丙并透，支中绝处逢生，木土互相护卫，金得流行，水得温和，木得发荣，火得生扶，用神必是甲木，为奋发之机。一交戊寅，云程直上；己卯早遂仕路之光；庚辰辛巳虽有制化之情，却无生扶之意，以致蹭蹬仕途，未能显秩也。',
    content: '身旺用食伤泄秀'
  },
  {
    indexString: '0,8,6,6,3,11,8,2',
    narrate: '此造天干四字，地支皆坐禄旺，惟日主坐当令之禄 ，足以任其财官。清而且厚。清足神旺，所以东西南北之运。皆无咎也。出遗业百余万，早登科甲，仁至方伯，六旬外退归林下；一妻四妾，十三子，优游晚景，寿越九旬。',
    content: '八字好走什么运都行'
  },
  {
    indexString: '9,1,1,1,9,1,9,1',
    narrate: '此天干三癸，地支一气，食神清透，杀印相生，皆云名利两全之格。予云：癸水至阴，又生季冬，支皆湿土，土湿水弱，沟渠之谓也；且水土冰冻，阴晦湿滞，无生发之气，名利皆虚，凡富贵之造，寒暖适中，精神奋发，未有阴寒湿带，偏枯之象而能富贵者也。至壬申年，父母皆亡，读书又不能通，又无恒业可守，人又阴弱，一无作为，竟为乞丐。',
    content: '一片水土，过于湿寒，需用木火，即食伤为用，运无食伤凶'
  },
  {
    indexString: '3,9,0,4,4,10,4,6',
    narrate: '此重重厚土，甲木退气，不能疏土，则土情必要年支酉金，发泄菁华。金逢火，盖其意亦欲日主之生，虽然远隔，两意情能，喜辰酉合而近之，如中有媒矣。初运癸卯壬寅，离间喜神，功名蹭蹬。困苦刑伤；辛丑运中，晦火会金入泮，连登科甲；庚子己亥戊戌，酉北土金之地，仕至尚书。',
    content: '印比重，食伤为用，喜辰酉和金为用'
  },
  {
    indexString: '3,9,1,5,3,1,2,6',
    narrate: '丁火生于巳月午时，比劫并旺，又逢木助，其势猛烈，年支酉金，本日主之所喜，遥隔远列，又被丁火盖之，巳火劫之，似乎无情。最喜坐下丑土，烈火逢湿土，则成生育慈爱之心，邀己酉合成金，归之库内，其情似相和好，不特财来就我，又能泄火吐秀，故能发甲，仕至藩臬，名利双全。',
    content: '印比旺，食伤为用，泄秀生财克印，整局很燥喜丑土润局'
  },
  {
    indexString: '9,9,4,6,2,4,0,6',
    narrate: '丙火生于午月时，旺可知矣。一点癸水，本不相浊，戊土合之，又助火之烈；年支酉金，本有情与辰合，又被午火离间，求合不得，年谓怨起恩中也。兼之运走东南火木之地，一生只刑伤破耗，并无财喜之事。克二妻七子，遭回禄四次，至寅运而亡。',
    content: '原局过燥，看似食神透干，但戊癸合火，食伤为用，运又走木火凶'
  },
  {
    indexString: '6,2,4,0,0,2,2,2',
    narrate: '甲木生于子月，两阳进气，旺印生身，支坐三寅，松柏之体，旺而且坚，一点庚金临绝，不能克木，反为忌神，寒木向阳，时干丙火清透，敌其寒凝，泄其菁英，而为用喜神冬火本虚，以寅木为喜神，月干戊土能制水，又能生金，故为闲神，以水为仇神，喜其丙火清纯。至卯运泄水生火，早登科甲；壬辰癸巳，得闲神制合，官途平坦；甲午乙未，火旺之地，仁至尚书。',
    content: '印比旺，食伤为用，财官生印则官为忌神财为闲神，木为喜神，木水两旺用火'
  },
  {
    indexString: '0,0,3,3,0,2,6,6',
    narrate: '甲木生于促春，支逢禄刃，干透比肩，旺之极矣，时上庚金，无根为忌，月干丁火为用，通辉之气。所以早登之路，仁至观察；惜无土之闲神，运至壬申，金水并伤体用，故不能免祸耳。',
    content: '印比重，用食伤'
  },
  {
    indexString: '1,7,6,4,4,4,2,4',
    narrate: '戊土生于季春，乙木官星透露，盘根在未，余气在辰，本可为用。嫌其合庚，谓贪合忌克，不顾日主之喜我，合而不化。庚金亦可作用，又有丙火当头，至二十一岁，因小试不利，即弃诗书，不事生产，以酒为事；且曰：高车大纛不为荣，连陌度阡，吾不为富，惟此怡悦性情，适吾口体，以终吾身，足矣！',
    content: '印比重，本来官可为用，乙庚和金食伤也可为用，但枭神夺食'
  },
  {
    indexString: '3,1,9,3,2,10,7,3',
    narrate: '丙火生于仲春，印正官清，日元生旺，足以用官。所嫌丙辛一合，不顾用神之辅我，辛金柔软，丙火逢之而怯，柔能制刚，恋恋不舍，忌有为之志；丙嫌卯戌合而化劫，所以幼年过目成诵，后因恋洒色，废学亡资，竟为酒色丧身，一事无成。',
    content: '官为用，丙辛和不顾官'
  },
  {
    indexString: '',
    narrate: '',
    content: ''
  },
  {
    indexString: '',
    narrate: '',
    content: ''
  },
]