export interface NumerologyData {
  indexString: string;
  narrate: string;
  content: string;
}

type NumerologyDatabaseType = NumerologyData[];

export const NumerologyDatabase: NumerologyDatabaseType = [
  {
    indexString: '6,8,8,6,7,9,9,5',
    narrate: '谓午火真神得用理应名利双收，但五行缺木，五行无木，金过多，壬午癸巳又伤官见官火被消耗没能量，不能克金，而且虽有巳火助午，但是巳酉拱金，巳被消耗不能助午。申中又得长生使壬水更强克制午火。所以申酉两运破耗异常。丙戌运中助起用神大得际遇，一交亥运，壬水得禄，癸水临旺，火气克尽，家婆身亡',
    content: '永远不知道自己想干什么，+40大得际遇，+50家破身亡。'
  },
  {
    indexString: '6,8,8,6,7,9,0,6',
    narrate: '金过旺，用午中丁火来杀之，壬午中壬水消耗午火，妙在甲午甲木生助午火，且壬水见甲木先去生甲木再生火，就没有过多能量消耗午火。',
    content: '本身八字好，四柱相生，当官发财。'
  },
  {
    indexString: '0,8,0,10,0,2,0,10',
    narrate: '年支申金冲去日主寅木，有戌土加持，生金助杀，是地支不顾天干，属于地支不载就不会太好，四甲一寅，看着木强旺有根，但秋木休囚，冲去禄神，其根已拔，不做旺论。寅卯亥子运中衣食颇丰，一到庚辰运，杀之元神透出庚金透干了，四子俱伤破家不禄。寅卯运时比较祥和，庚辰得时候地支冲克不得安宁',
    content: '+40，50衣食颇丰，+60家破人亡'
  },
  {
    indexString: '4,0,4,6,4,10,4,6',
    narrate: '子衰午旺，把水消耗光了，天干不覆，已未运孤苦万状，庚申辛酉运引通戌土大得际遇，娶妻生子成家立业，金生水生财，壬戌运，水不通根，暗拱火局，一家五口皆亡。',
    content: '+10命苦，+20，30娶妻生子成家立业，+40家破人亡。'
  },
  {
    indexString: '4,8,4,6,4,10,4,6',
    narrate: '天干之气下降，地支之水有源，午火虽烈，究不能伤申金，用金明矣，申金不太怕火克，天干生申金食伤，食伤泄秀。',
    content: '前面顺遂，+40会难受些，+50还会好'
  },
  {
    indexString: '7,3,7,3,7,3,7,3',
    narrate: '辛金是很弱得金，无力克卯木，如果用财能好一点，但是运走得不行，己丑戊子运，印绶生扶，衣食无亏；一交丁亥，生火克金，即亡其师，所有微业，嫖赌扫尽而死。',
    content: '+20，30衣食无亏，+40不好了'
  },
  {
    indexString: '7,3,6,2,0,4,2,2',
    narrate: '地支有寅卯辰三会局，又在寅时相当得旺。年月两金临绝，庚辛都是绝，官杀无力。食伤和比劫都代表自己，在克官杀，官杀能治就能得到一些权力，早年土运生金破耗异常。官杀被治就得道了。丙戌运庚辛克尽变好，走到酉庚辛金生根了不好',
    content: '+20破耗，+40好起来了，+50又不行了'
  },
  {
    indexString: '6,2,6,4,0,2,3,3',
    narrate: '辰土还是要生七杀庚金的，庚金得载，力量足以克木，丁火虽透，非庚金之敌，丁火没有丙火旺，所以这个八字要用官杀，至甲申运，庚金禄旺暗冲寅木，一交丙运制杀，官运衰败',
    content: '+40运好高升，+60降职归田'
  },
  {
    indexString: '0,5,2,4,2,6,6,2',
    narrate: '火木比较旺，天干金水似乎无根，癸水在巳火上，庚金在寅木上，两个都相克能量不够，癸水坐巳为胎能量不够官星不旺，庚金坐寅为绝地能量也不够。好在戊土能生金，金还可用。癸水即庚金之喜神。水能润局庚金就有能力了。初运乙卯甲寅，金绝火生而水泄，孤苦不堪。一交癸丑北方阴湿之地，金水通根，又得巳丑拱金之妙，出外大得际遇。',
    content: '+10，20孤苦不堪。+30发财。'
  },
  {
    indexString: '4,2,1,1,2,2,6,2',
    narrate: '整体偏阳，走西北土金运会特别好，走水可能也会好，走水对这个局泄耗会多，所以走土金更好，但是大运寅卯辰巳午未东南阳暖运，生不逢时，一路东南木火之地，祖业破尽，遍历数省，奔驰不遇，至午运暗会劫局，身死',
    content: '一事无成。'
  },
  {
    indexString: '2,0,5,11,1,9,8,6',
    narrate: '此全酉、亥、子西北之阴寒。太阴寒了，又亥月为乙木之死地，酉金为乙木的绝地，所以木很难生长。对乙木来说地支的根气基本废掉了，所以丙火为用神，己土能稳固一下环境，水太旺根被泡坏，有土能稳固一下根气。且喜天干水木火土，各立门户，相生有情，不但四柱有情，而且行运光亨。阴阳配合的好一路顺遂。',
    content: '一路顺遂。'
  },
  {
    indexString: '5,11,2,0,1,1,8,6',
    narrate: '亥子丑三会水局，午火就废掉了，走的又是金水运，地支水更旺，，丙火本来就坐在子水上也没什么用，午火子午一冲也没什么用了。所以屈志芸窗，一贫如洗，克妻无子，至壬申运，丙火克尽而亡。',
    content: '比较笨的人，想的特别的做的比较少，一贫如洗，克妻无子，+40死。'
  },
  {
    indexString: '0,2,4,4,2,2,2,8',
    narrate: '丙火生于春天能量还是比较大的，寅木长生，又生在甲木的年份火特别旺的还是，印这么旺还是喜冲的，冲一冲还是有好处的，早年运走南方，起倒异常。木火为阳，早年走南方运阳太旺就不好了。巳午未运都是南方运，走到壬申癸酉就好了。壬申运寅申冲，把偏印冲掉七杀一来能量就强了，克去比肩，创业兴家。',
    content: '+10，20，30都不太好，+40，50，60就好了创业兴家。'
  },
  {
    indexString: '8,8,0,4,2,2,2,8',
    narrate: '此造之壬水，乃甲木之原神，断不可伤，壬水受伤，甲木必孤。凡独杀用印者，最忌制杀也。运走戊申伤壬水就不好了。运走丙午劫去申财，入学补廪登科。丁未合去壬水，三走春闱不捷。',
    content: '+20入学登科，+30不顺，+40身死'
  },
  {
    indexString: '5,5,7,7,8,6,1,5',
    narrate: '巳午未的南方火局。脆金难滋水源，火燥土焦很难生印星金。其意向必在午中丁火而合从矣。从弱了。己巳戊辰运，生金泄火，刑耗有之；丁卯丙寅，木火并旺，克尽辛金，经营发财巨万。属于走木火运从格了',
    content: '+20，30邢浩有之，+40，50从格遇火发财了'
  },
  {
    indexString: '5,1,2,0,3,11,6,0',
    narrate: '地支亥子丑三会北方水。天干火虚，无木生扶，又有湿土晦火，天衰极矣。夏天把旺神触起来了触霉头。戊寅岁，金绝火生，又合去亥水，必有大凶，果卒季夏。此地支官星乘旺，又类官方，天干无印，己土泄丙，未足帮身，此为天地合而从官也。甲戌运生火克水，刑丧破耗，家业已尽。癸酉壬申克尽丙火，助起财官，获利五万。财官旺了从格。辛未庚午取其火土帮身，比劫夺财，反致大凶。本来从格了又来帮身相克变大凶。',
    content: '+20有大凶家业尽，+30，40获利。+50，60大凶'
  },
  {
    indexString: '8,6,5,9,0,8,0,0',
    narrate: '甲申日元，生于八月，官杀当权，喜其午火紧制酉金，子水化其申金，所谓去官留煞。煞印相生，木凋金旺，印星为用，甲第联登。杀印相生的配置。又有伤官见官，大运亥子丑中印压制伤官能量，化了官杀。后又走比劫运比较好的。',
    content: '生来是个当官命'
  },
  {
    indexString: '8,4,5,9,0,8,0,0',
    narrate: '申子辰有水局像，大运庚戌水局被破，辰酉离得近不治官而变成七杀帮凶，子印就苦苦支撑，生在秋天的木本来就不太好过，酉月为胎地。能撑到晚年就还行。',
    content: '+10运就废了'
  },
  {
    indexString: '',
    narrate: '',
    content: ''
  },
]